zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
/*
 * Copyright 2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_IOMUXC_H_
#define _FSL_IOMUXC_H_

#include "fsl_common.h"

/*!
 * @addtogroup iomuxc_driver
 * @{
 */

/*! @file */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.iomuxc"
#endif

/*! @name Driver version */
/*@{*/
/*! @brief IOMUXC driver version 2.0.0. */
#define FSL_IOMUXC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*!
 * @name Pin function ID
 * The pin function ID is a tuple of \<muxRegister muxMode inputRegister inputDaisy configRegister\>
 *
 * @{
 */
#define IOMUXC_PIO2_0_HSP_GPIO0_GPIO0                                                           0x421C0000U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_HSP_LPUART0_CTS_B                                                         0x421C0000U, 0x1U, 0X421C823CU, 0x0U
#define IOMUXC_PIO2_0_HSP_FLEXIO0_FXIO_D00                                                      0x421C0000U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_AUDIO_SAI0_TX_DATA0                                                       0x421C0000U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_HSP_eFlexPWM0_PWM_A0                                                      0x421C0000U, 0x4U, 0X421C810CU, 0x0U
#define IOMUXC_PIO2_0_MAIN_AHB_SRAMC_SRAMC_DA00                                                 0x421C0000U, 0x5U, 0X421C83A4U, 0x0U
#define IOMUXC_PIO2_0_HSP_QTPM0_CH0                                                             0x421C0000U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_MEDIA_DCIF_DATA00                                                         0x421C0000U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_0_HSP_LPI2C0_SDA                                                            0x421C0000U, 0x8U, 0X421C81A4U, 0x0U
#define IOMUXC_PIO2_0_HSP_XBAR0_INOUT00                                                         0x421C0000U, 0xAU, 0X421C82C4U, 0x0U
#define IOMUXC_PIO2_0_HSP_XBAR1_INOUT00                                                         0x421C0000U, 0xBU, 0X421C8334U, 0x0U

#define IOMUXC_PIO2_1_HSP_GPIO0_GPIO1                                                           0x421C0004U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_LPUART0_RTS_B                                                         0x421C0004U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_FLEXIO0_FXIO_D01                                                      0x421C0004U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_AUDIO_SAI0_RX_DATA0                                                       0x421C0004U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_eFlexPWM0_PWM_B0                                                      0x421C0004U, 0x4U, 0X421C8118U, 0x0U
#define IOMUXC_PIO2_1_MAIN_AHB_SRAMC_SRAMC_DA01                                                 0x421C0004U, 0x5U, 0X421C83A8U, 0x0U
#define IOMUXC_PIO2_1_HSP_QTPM0_CH1                                                             0x421C0004U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_MEDIA_DCIF_DATA01                                                         0x421C0004U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_1_HSP_LPI2C0_SCL                                                            0x421C0004U, 0x8U, 0X421C81A0U, 0x0U
#define IOMUXC_PIO2_1_HSP_XBAR0_INOUT01                                                         0x421C0004U, 0xAU, 0X421C82C8U, 0x0U
#define IOMUXC_PIO2_1_HSP_XBAR1_INOUT01                                                         0x421C0004U, 0xBU, 0X421C8338U, 0x0U

#define IOMUXC_PIO2_2_HSP_GPIO0_GPIO2                                                           0x421C0008U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_HSP_LPUART0_TXD                                                           0x421C0008U, 0x1U, 0X421C8244U, 0x0U
#define IOMUXC_PIO2_2_HSP_FLEXIO0_FXIO_D02                                                      0x421C0008U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_AUDIO_SAI0_TX_BCLK                                                        0x421C0008U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_HSP_eFlexPWM0_PWM_A1                                                      0x421C0008U, 0x4U, 0X421C8110U, 0x0U
#define IOMUXC_PIO2_2_MAIN_AHB_SRAMC_SRAMC_DA02                                                 0x421C0008U, 0x5U, 0X421C83ACU, 0x0U
#define IOMUXC_PIO2_2_HSP_QTPM0_CH2                                                             0x421C0008U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_MEDIA_DCIF_DATA02                                                         0x421C0008U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_2_HSP_LPI2C1_SDA                                                            0x421C0008U, 0x8U, 0X421C81ACU, 0x0U
#define IOMUXC_PIO2_2_HSP_XBAR0_INOUT02                                                         0x421C0008U, 0xAU, 0X421C82CCU, 0x0U
#define IOMUXC_PIO2_2_HSP_XBAR1_INOUT02                                                         0x421C0008U, 0xBU, 0X421C833CU, 0x0U

#define IOMUXC_PIO2_3_HSP_GPIO0_GPIO3                                                           0x421C000CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_HSP_LPUART0_RXD                                                           0x421C000CU, 0x1U, 0X421C8240U, 0x0U
#define IOMUXC_PIO2_3_HSP_FLEXIO0_FXIO_D03                                                      0x421C000CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_AUDIO_SAI0_TX_SYNC                                                        0x421C000CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_HSP_eFlexPWM0_PWM_B1                                                      0x421C000CU, 0x4U, 0X421C811CU, 0x0U
#define IOMUXC_PIO2_3_MAIN_AHB_SRAMC_SRAMC_DA03                                                 0x421C000CU, 0x5U, 0X421C83B0U, 0x0U
#define IOMUXC_PIO2_3_HSP_QTPM0_CH3                                                             0x421C000CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_MEDIA_DCIF_DATA03                                                         0x421C000CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_3_HSP_LPI2C1_SCL                                                            0x421C000CU, 0x8U, 0X421C81A8U, 0x0U
#define IOMUXC_PIO2_3_HSP_XBAR0_INOUT03                                                         0x421C000CU, 0xAU, 0X421C82D0U, 0x0U
#define IOMUXC_PIO2_3_HSP_XBAR1_INOUT03                                                         0x421C000CU, 0xBU, 0X421C8340U, 0x0U

#define IOMUXC_PIO2_4_HSP_GPIO0_GPIO4                                                           0x421C0010U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_LPUART1_CTS_B                                                         0x421C0010U, 0x1U, 0X421C8248U, 0x0U
#define IOMUXC_PIO2_4_HSP_FLEXIO0_FXIO_D04                                                      0x421C0010U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_AUDIO_SAI0_MCLK                                                           0x421C0010U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_eFlexPWM0_PWM_A2                                                      0x421C0010U, 0x4U, 0X421C8114U, 0x0U
#define IOMUXC_PIO2_4_MAIN_AHB_SRAMC_SRAMC_DA04                                                 0x421C0010U, 0x5U, 0X421C83B4U, 0x0U
#define IOMUXC_PIO2_4_HSP_QTPM0_CH4                                                             0x421C0010U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_MEDIA_DCIF_DATA04                                                         0x421C0010U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_LPSPI0_PCS0                                                           0x421C0010U, 0x8U, 0X421C81B0U, 0x0U
#define IOMUXC_PIO2_4_MAIN_TRACE3                                                               0x421C0010U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_4_HSP_XBAR0_INOUT04                                                         0x421C0010U, 0xAU, 0X421C82D4U, 0x0U
#define IOMUXC_PIO2_4_HSP_XBAR1_INOUT04                                                         0x421C0010U, 0xBU, 0X421C8344U, 0x0U

#define IOMUXC_PIO2_5_HSP_GPIO0_GPIO5                                                           0x421C0014U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_LPUART1_RTS_B                                                         0x421C0014U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_FLEXIO0_FXIO_D05                                                      0x421C0014U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_AUDIO_SAI0_RX_BCLK                                                        0x421C0014U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_eFlexPWM0_PWM_B2                                                      0x421C0014U, 0x4U, 0X421C8120U, 0x0U
#define IOMUXC_PIO2_5_MAIN_AHB_SRAMC_SRAMC_DA05                                                 0x421C0014U, 0x5U, 0X421C83B8U, 0x0U
#define IOMUXC_PIO2_5_HSP_QTPM0_CH5                                                             0x421C0014U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_MEDIA_DCIF_DATA05                                                         0x421C0014U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_LPSPI0_SOUT                                                           0x421C0014U, 0x8U, 0X421C81C8U, 0x0U
#define IOMUXC_PIO2_5_MAIN_TRACE2                                                               0x421C0014U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_5_HSP_XBAR0_INOUT05                                                         0x421C0014U, 0xAU, 0X421C82D8U, 0x0U
#define IOMUXC_PIO2_5_HSP_XBAR1_INOUT05                                                         0x421C0014U, 0xBU, 0X421C8348U, 0x0U

