zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO2_6_HSP_GPIO0_GPIO6                                                           0x421C0018U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_LPUART1_TXD                                                           0x421C0018U, 0x1U, 0X421C8250U, 0x0U
#define IOMUXC_PIO2_6_HSP_FLEXIO0_FXIO_D06                                                      0x421C0018U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_AUDIO_SAI0_RX_SYNC                                                        0x421C0018U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_eFlexPWM0_PWM_A3                                                      0x421C0018U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_MAIN_AHB_SRAMC_SRAMC_DA06                                                 0x421C0018U, 0x5U, 0X421C83BCU, 0x0U
#define IOMUXC_PIO2_6_HSP_QTPM0_CH6                                                             0x421C0018U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_MEDIA_DCIF_DATA06                                                         0x421C0018U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_LPSPI0_SIN                                                            0x421C0018U, 0x8U, 0X421C81C4U, 0x0U
#define IOMUXC_PIO2_6_MAIN_TRACE1                                                               0x421C0018U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_6_HSP_XBAR0_INOUT06                                                         0x421C0018U, 0xAU, 0X421C82DCU, 0x0U
#define IOMUXC_PIO2_6_HSP_XBAR1_INOUT06                                                         0x421C0018U, 0xBU, 0X421C834CU, 0x0U
#define IOMUXC_PIO2_6_COMM_uSDHC0_TST_TRG                                                       0x421C0018U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO2_7_HSP_GPIO0_GPIO7                                                           0x421C001CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_LPUART1_RXD                                                           0x421C001CU, 0x1U, 0X421C824CU, 0x0U
#define IOMUXC_PIO2_7_HSP_FLEXIO0_FXIO_D07                                                      0x421C001CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_AUDIO_SAI0_TX_DATA1                                                       0x421C001CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_eFlexPWM0_PWM_B3                                                      0x421C001CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_MAIN_AHB_SRAMC_SRAMC_DA07                                                 0x421C001CU, 0x5U, 0X421C83C0U, 0x0U
#define IOMUXC_PIO2_7_HSP_QTPM0_CH7                                                             0x421C001CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_MEDIA_DCIF_DATA07                                                         0x421C001CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_LPSPI0_SCK                                                            0x421C001CU, 0x8U, 0X421C81C0U, 0x0U
#define IOMUXC_PIO2_7_MAIN_TRACE0                                                               0x421C001CU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_7_HSP_XBAR0_INOUT07                                                         0x421C001CU, 0xAU, 0X421C82E0U, 0x0U
#define IOMUXC_PIO2_7_HSP_XBAR1_INOUT07                                                         0x421C001CU, 0xBU, 0X421C8350U, 0x0U
#define IOMUXC_PIO2_7_COMM_uSDHC1_TST_TRG                                                       0x421C001CU, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO2_8_HSP_GPIO0_GPIO8                                                           0x421C0020U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_LPUART2_TXD                                                           0x421C0020U, 0x1U, 0X421C825CU, 0x0U
#define IOMUXC_PIO2_8_HSP_FLEXIO0_FXIO_D08                                                      0x421C0020U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_AUDIO_SAI0_RX_DATA1                                                       0x421C0020U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_SINC0_MCLK0                                                           0x421C0020U, 0x4U, 0X421C8294U, 0x0U
#define IOMUXC_PIO2_8_MAIN_AHB_SRAMC_SRAMC_LBB                                                  0x421C0020U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_SINC0_MCLK_OUT0                                                       0x421C0020U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_MEDIA_DCIF_DATA08                                                         0x421C0020U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_LPSPI0_PCS1                                                           0x421C0020U, 0x8U, 0X421C81B4U, 0x0U
#define IOMUXC_PIO2_8_MAIN_TRACE_CLK                                                            0x421C0020U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_8_HSP_XBAR0_INOUT08                                                         0x421C0020U, 0xAU, 0X421C82E4U, 0x0U
#define IOMUXC_PIO2_8_HSP_XBAR1_INOUT08                                                         0x421C0020U, 0xBU, 0X421C8354U, 0x0U

#define IOMUXC_PIO2_9_HSP_GPIO0_GPIO9                                                           0x421C0024U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_HSP_LPUART2_RXD                                                           0x421C0024U, 0x1U, 0X421C8258U, 0x0U
#define IOMUXC_PIO2_9_HSP_FLEXIO0_FXIO_D09                                                      0x421C0024U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_AUDIO_SAI0_TX_DATA2                                                       0x421C0024U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_HSP_SINC0_MCLK1                                                           0x421C0024U, 0x4U, 0X421C8298U, 0x0U
#define IOMUXC_PIO2_9_MAIN_AHB_SRAMC_SRAMC_DA08                                                 0x421C0024U, 0x5U, 0X421C83C4U, 0x0U
#define IOMUXC_PIO2_9_HSP_SINC0_MCLK_OUT1                                                       0x421C0024U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_MEDIA_DCIF_DATA09                                                         0x421C0024U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_9_HSP_LPSPI0_PCS2                                                           0x421C0024U, 0x8U, 0X421C81B8U, 0x0U
#define IOMUXC_PIO2_9_HSP_XBAR0_INOUT09                                                         0x421C0024U, 0xAU, 0X421C82E8U, 0x0U
#define IOMUXC_PIO2_9_HSP_XBAR1_INOUT09                                                         0x421C0024U, 0xBU, 0X421C8358U, 0x0U

#define IOMUXC_PIO2_10_HSP_GPIO0_GPIO10                                                         0x421C0028U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_HSP_LPUART2_CTS_B                                                        0x421C0028U, 0x1U, 0X421C8254U, 0x0U
#define IOMUXC_PIO2_10_HSP_FLEXIO0_FXIO_D10                                                     0x421C0028U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_AUDIO_SAI0_RX_DATA2                                                      0x421C0028U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_HSP_SINC0_MCLK2                                                          0x421C0028U, 0x4U, 0X421C829CU, 0x0U
#define IOMUXC_PIO2_10_MAIN_AHB_SRAMC_SRAMC_DA09                                                0x421C0028U, 0x5U, 0X421C83C8U, 0x0U
#define IOMUXC_PIO2_10_HSP_SINC0_MCLK_OUT2                                                      0x421C0028U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_MEDIA_DCIF_DATA10                                                        0x421C0028U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_10_HSP_LPSPI0_PCS3                                                          0x421C0028U, 0x8U, 0X421C81BCU, 0x0U
#define IOMUXC_PIO2_10_HSP_XBAR0_INOUT10                                                        0x421C0028U, 0xAU, 0X421C82ECU, 0x0U
#define IOMUXC_PIO2_10_HSP_XBAR1_INOUT10                                                        0x421C0028U, 0xBU, 0X421C835CU, 0x0U

#define IOMUXC_PIO2_11_HSP_GPIO0_GPIO11                                                         0x421C002CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_LPUART2_RTS_B                                                        0x421C002CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_FLEXIO0_FXIO_D11                                                     0x421C002CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_AUDIO_SAI0_TX_DATA3                                                      0x421C002CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_SINC0_MCLK3                                                          0x421C002CU, 0x4U, 0X421C82A0U, 0x0U
#define IOMUXC_PIO2_11_MAIN_AHB_SRAMC_SRAMC_DA10                                                0x421C002CU, 0x5U, 0X421C83CCU, 0x0U
#define IOMUXC_PIO2_11_MEDIA_DCIF_DATA11                                                        0x421C002CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_11_HSP_XBAR0_INOUT11                                                        0x421C002CU, 0xAU, 0X421C82F0U, 0x0U
#define IOMUXC_PIO2_11_HSP_XBAR1_INOUT11                                                        0x421C002CU, 0xBU, 0X421C8360U, 0x0U

#define IOMUXC_PIO2_12_HSP_GPIO0_GPIO12                                                         0x421C0030U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_HSP_LPUART3_TXD                                                          0x421C0030U, 0x1U, 0X421C8268U, 0x0U
#define IOMUXC_PIO2_12_HSP_FLEXIO0_FXIO_D12                                                     0x421C0030U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_AUDIO_SAI0_RX_DATA3                                                      0x421C0030U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_HSP_SINC0_MBIT0                                                          0x421C0030U, 0x4U, 0X421C8284U, 0x0U
#define IOMUXC_PIO2_12_MAIN_AHB_SRAMC_SRAMC_DA11                                                0x421C0030U, 0x5U, 0X421C83D0U, 0x0U
#define IOMUXC_PIO2_12_MEDIA_DCIF_DATA12                                                        0x421C0030U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_12_HSP_LPI2C0_SDA                                                           0x421C0030U, 0x8U, 0X421C81A4U, 0x1U
#define IOMUXC_PIO2_12_HSP_XBAR0_INOUT12                                                        0x421C0030U, 0xAU, 0X421C82F4U, 0x0U
#define IOMUXC_PIO2_12_HSP_XBAR1_INOUT12                                                        0x421C0030U, 0xBU, 0X421C8364U, 0x0U

#define IOMUXC_PIO2_13_HSP_GPIO0_GPIO13                                                         0x421C0034U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_HSP_LPUART3_RXD                                                          0x421C0034U, 0x1U, 0X421C8264U, 0x0U
#define IOMUXC_PIO2_13_HSP_FLEXIO0_FXIO_D13                                                     0x421C0034U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_WAKE_EWM_OUT_B                                                           0x421C0034U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_HSP_SINC0_MBIT1                                                          0x421C0034U, 0x4U, 0X421C8288U, 0x0U
#define IOMUXC_PIO2_13_MAIN_AHB_SRAMC_SRAMC_DA12                                                0x421C0034U, 0x5U, 0X421C83D4U, 0x0U
#define IOMUXC_PIO2_13_HSP_eFlexPWM0_PWM_X0                                                     0x421C0034U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_MEDIA_DCIF_DATA13                                                        0x421C0034U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_13_HSP_LPI2C0_SCL                                                           0x421C0034U, 0x8U, 0X421C81A0U, 0x1U
#define IOMUXC_PIO2_13_HSP_XBAR0_INOUT13                                                        0x421C0034U, 0xAU, 0X421C82F8U, 0x0U
#define IOMUXC_PIO2_13_HSP_XBAR1_INOUT13                                                        0x421C0034U, 0xBU, 0X421C8368U, 0x0U

#define IOMUXC_PIO2_14_HSP_GPIO0_GPIO14                                                         0x421C0038U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_LPUART3_CTS_B                                                        0x421C0038U, 0x1U, 0X421C8260U, 0x0U
#define IOMUXC_PIO2_14_HSP_FLEXIO0_FXIO_D14                                                     0x421C0038U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_AUDIO_MICFIL_PDM_CLK                                                     0x421C0038U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_SINC0_MBIT2                                                          0x421C0038U, 0x4U, 0X421C828CU, 0x0U
#define IOMUXC_PIO2_14_MAIN_AHB_SRAMC_SRAMC_DA13                                                0x421C0038U, 0x5U, 0X421C83D8U, 0x0U
#define IOMUXC_PIO2_14_HSP_eFlexPWM0_PWM_X1                                                     0x421C0038U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_MEDIA_DCIF_DATA14                                                        0x421C0038U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_FlexCAN0_CAN_TX                                                      0x421C0038U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_14_HSP_XBAR0_INOUT14                                                        0x421C0038U, 0xAU, 0X421C82FCU, 0x0U
#define IOMUXC_PIO2_14_HSP_XBAR1_INOUT14                                                        0x421C0038U, 0xBU, 0X421C836CU, 0x0U

#define IOMUXC_PIO2_15_HSP_GPIO0_GPIO15                                                         0x421C003CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_LPUART3_RTS_B                                                        0x421C003CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_FLEXIO0_FXIO_D15                                                     0x421C003CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_AUDIO_MICFIL_PDM_DATA45                                                  0x421C003CU, 0x3U, 0X421C8008U, 0x0U
#define IOMUXC_PIO2_15_HSP_SINC0_MBIT3                                                          0x421C003CU, 0x4U, 0X421C8290U, 0x0U
#define IOMUXC_PIO2_15_MAIN_AHB_SRAMC_SRAMC_DA14                                                0x421C003CU, 0x5U, 0X421C83DCU, 0x0U
#define IOMUXC_PIO2_15_HSP_eFlexPWM0_PWM_X2                                                     0x421C003CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_MEDIA_DCIF_DATA15                                                        0x421C003CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_FlexCAN0_CAN_RX                                                      0x421C003CU, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_15_HSP_XBAR0_INOUT15                                                        0x421C003CU, 0xAU, 0X421C8300U, 0x0U
#define IOMUXC_PIO2_15_HSP_XBAR1_INOUT15                                                        0x421C003CU, 0xBU, 0X421C8370U, 0x0U

#define IOMUXC_PIO2_16_HSP_GPIO0_GPIO16                                                         0x421C0040U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_HSP_LPUART4_TXD                                                          0x421C0040U, 0x1U, 0X421C8274U, 0x0U
#define IOMUXC_PIO2_16_HSP_FLEXIO0_FXIO_D16                                                     0x421C0040U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_AUDIO_MICFIL_PDM_DATA23                                                  0x421C0040U, 0x3U, 0X421C8004U, 0x0U
#define IOMUXC_PIO2_16_HSP_SINC0_BREAK                                                          0x421C0040U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_MAIN_AHB_SRAMC_SRAMC_DA15                                                0x421C0040U, 0x5U, 0X421C83E0U, 0x0U
#define IOMUXC_PIO2_16_HSP_eFlexPWM0_PWM_X3                                                     0x421C0040U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_MEDIA_DCIF_DATA16                                                        0x421C0040U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_HSP_FlexCAN1_CAN_TX                                                      0x421C0040U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_16_HSP_XBAR0_INOUT16                                                        0x421C0040U, 0xAU, 0X421C8304U, 0x0U
#define IOMUXC_PIO2_16_HSP_XBAR1_INOUT16                                                        0x421C0040U, 0xBU, 0X421C8374U, 0x0U

#define IOMUXC_PIO2_17_HSP_GPIO0_GPIO17                                                         0x421C0044U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_HSP_LPUART4_RXD                                                          0x421C0044U, 0x1U, 0X421C8270U, 0x0U
#define IOMUXC_PIO2_17_HSP_FLEXIO0_FXIO_D17                                                     0x421C0044U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_AUDIO_MICFIL_PDM_DATA01                                                  0x421C0044U, 0x3U, 0X421C8000U, 0x0U
#define IOMUXC_PIO2_17_AUDIO_MQS_MQS_LEFT                                                       0x421C0044U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_MAIN_AHB_SRAMC_SRAMC_UBB                                                 0x421C0044U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_AUDIO_SAI1_MCLK                                                          0x421C0044U, 0x6U, 0X421C800CU, 0x0U
#define IOMUXC_PIO2_17_MEDIA_DCIF_DATA17                                                        0x421C0044U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_17_HSP_FlexCAN1_CAN_RX                                                      0x421C0044U, 0x8U, 0X421C8104U, 0x0U
#define IOMUXC_PIO2_17_HSP_XBAR0_INOUT17                                                        0x421C0044U, 0xAU, 0X421C8308U, 0x0U
#define IOMUXC_PIO2_17_HSP_XBAR1_INOUT17                                                        0x421C0044U, 0xBU, 0X421C8378U, 0x0U

#define IOMUXC_PIO2_18_HSP_GPIO0_GPIO18                                                         0x421C0048U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_HSP_LPUART4_CTS_B                                                        0x421C0048U, 0x1U, 0X421C826CU, 0x0U
#define IOMUXC_PIO2_18_HSP_FLEXIO0_FXIO_D18                                                     0x421C0048U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_AUDIO_MQS_MQS_RIGHT                                                      0x421C0048U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_MAIN_AHB_SRAMC_SRAMC_WEB                                                 0x421C0048U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_AUDIO_SAI1_TX_BCLK                                                       0x421C0048U, 0x6U, 0X421C8020U, 0x0U
#define IOMUXC_PIO2_18_MEDIA_DCIF_DATA18                                                        0x421C0048U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_18_HSP_XBAR0_INOUT18                                                        0x421C0048U, 0xAU, 0X421C830CU, 0x0U
#define IOMUXC_PIO2_18_HSP_XBAR1_INOUT18                                                        0x421C0048U, 0xBU, 0X421C837CU, 0x0U

