zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO2_19_HSP_GPIO0_GPIO19                                                         0x421C004CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_LPUART4_RTS_B                                                        0x421C004CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_FLEXIO0_FXIO_D19                                                     0x421C004CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_eFlexPWM1_PWM_X0                                                     0x421C004CU, 0x4U, 0X421C8144U, 0x0U
#define IOMUXC_PIO2_19_MAIN_AHB_SRAMC_SRAMC_OEB                                                 0x421C004CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_AUDIO_SAI1_TX_SYNC                                                       0x421C004CU, 0x6U, 0X421C8024U, 0x0U
#define IOMUXC_PIO2_19_MEDIA_DCIF_DATA19                                                        0x421C004CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_19_HSP_XBAR0_INOUT19                                                        0x421C004CU, 0xAU, 0X421C8310U, 0x0U
#define IOMUXC_PIO2_19_HSP_XBAR1_INOUT19                                                        0x421C004CU, 0xBU, 0X421C8380U, 0x0U

#define IOMUXC_PIO2_20_HSP_GPIO0_GPIO20                                                         0x421C0050U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_HSP_LPUART5_TXD                                                          0x421C0050U, 0x1U, 0X421C8280U, 0x0U
#define IOMUXC_PIO2_20_HSP_FLEXIO0_FXIO_D20                                                     0x421C0050U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_COMM_USB0_PWR                                                            0x421C0050U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_HSP_eFlexPWM1_PWM_A3                                                     0x421C0050U, 0x4U, 0X421C8130U, 0x0U
#define IOMUXC_PIO2_20_MAIN_AHB_SRAMC_SRAMC_WP0                                                 0x421C0050U, 0x5U, 0X421C83E4U, 0x0U
#define IOMUXC_PIO2_20_AUDIO_SAI1_TX_DATA0                                                      0x421C0050U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_MEDIA_DCIF_DATA20                                                        0x421C0050U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_20_HSP_XBAR0_INOUT20                                                        0x421C0050U, 0xAU, 0X421C8314U, 0x0U
#define IOMUXC_PIO2_20_HSP_XBAR1_INOUT20                                                        0x421C0050U, 0xBU, 0X421C8384U, 0x0U

#define IOMUXC_PIO2_21_HSP_GPIO0_GPIO21                                                         0x421C0054U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_21_HSP_LPUART5_RXD                                                          0x421C0054U, 0x1U, 0X421C827CU, 0x0U
#define IOMUXC_PIO2_21_HSP_FLEXIO0_FXIO_D21                                                     0x421C0054U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_21_COMM_USB0_OC                                                             0x421C0054U, 0x3U, 0X421C80A4U, 0x0U
#define IOMUXC_PIO2_21_HSP_eFlexPWM1_PWM_B3                                                     0x421C0054U, 0x4U, 0X421C8140U, 0x0U
#define IOMUXC_PIO2_21_MAIN_AHB_SRAMC_SRAMC_WP1                                                 0x421C0054U, 0x5U, 0X421C83E8U, 0x0U
#define IOMUXC_PIO2_21_AUDIO_SAI1_RX_DATA0                                                      0x421C0054U, 0x6U, 0X421C8014U, 0x0U
#define IOMUXC_PIO2_21_MEDIA_DCIF_DATA21                                                        0x421C0054U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_21_HSP_LPSPI1_PCS3                                                          0x421C0054U, 0x9U, 0X421C81D8U, 0x0U
#define IOMUXC_PIO2_21_HSP_XBAR0_INOUT21                                                        0x421C0054U, 0xAU, 0X421C8318U, 0x0U
#define IOMUXC_PIO2_21_HSP_XBAR1_INOUT21                                                        0x421C0054U, 0xBU, 0X421C8388U, 0x0U

#define IOMUXC_PIO2_22_HSP_GPIO0_GPIO22                                                         0x421C0058U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_22_HSP_LPUART5_CTS_B                                                        0x421C0058U, 0x1U, 0X421C8278U, 0x0U
#define IOMUXC_PIO2_22_HSP_FLEXIO0_FXIO_D22                                                     0x421C0058U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_22_COMM_USB0_ID                                                             0x421C0058U, 0x3U, 0X421C80A8U, 0x0U
#define IOMUXC_PIO2_22_HSP_eFlexPWM1_PWM_A2                                                     0x421C0058U, 0x4U, 0X421C812CU, 0x0U
#define IOMUXC_PIO2_22_MAIN_XSPI0_ECS                                                           0x421C0058U, 0x5U, 0X421C83ECU, 0x0U
#define IOMUXC_PIO2_22_AUDIO_SAI1_MCLK                                                          0x421C0058U, 0x6U, 0X421C800CU, 0x1U
#define IOMUXC_PIO2_22_MEDIA_DCIF_DATA22                                                        0x421C0058U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_22_HSP_LPSPI1_PCS2                                                          0x421C0058U, 0x9U, 0X421C81D4U, 0x0U
#define IOMUXC_PIO2_22_HSP_XBAR0_INOUT22                                                        0x421C0058U, 0xAU, 0X421C831CU, 0x0U
#define IOMUXC_PIO2_22_HSP_XBAR1_INOUT22                                                        0x421C0058U, 0xBU, 0X421C838CU, 0x0U

#define IOMUXC_PIO2_23_HSP_GPIO0_GPIO23                                                         0x421C005CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_LPUART5_RTS_B                                                        0x421C005CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_FLEXIO0_FXIO_D23                                                     0x421C005CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_eFlexPWM1_PWM_B2                                                     0x421C005CU, 0x4U, 0X421C813CU, 0x0U
#define IOMUXC_PIO2_23_HSP_eFlexPWM1_PWM_X0                                                     0x421C005CU, 0x5U, 0X421C8144U, 0x1U
#define IOMUXC_PIO2_23_AUDIO_SAI1_RX_BCLK                                                       0x421C005CU, 0x6U, 0X421C8010U, 0x0U
#define IOMUXC_PIO2_23_MEDIA_DCIF_DATA23                                                        0x421C005CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_23_HSP_LPSPI1_PCS1                                                          0x421C005CU, 0x9U, 0X421C81D0U, 0x0U
#define IOMUXC_PIO2_23_HSP_XBAR0_INOUT23                                                        0x421C005CU, 0xAU, 0X421C8320U, 0x0U
#define IOMUXC_PIO2_23_HSP_XBAR1_INOUT23                                                        0x421C005CU, 0xBU, 0X421C8390U, 0x0U

