zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO2_24_HSP_GPIO0_GPIO24                                                         0x421C0060U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_24_HSP_LPI2C1_SDA                                                           0x421C0060U, 0x1U, 0X421C81ACU, 0x1U
#define IOMUXC_PIO2_24_HSP_FLEXIO0_FXIO_D24                                                     0x421C0060U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_24_HSP_I3C_SDA                                                              0x421C0060U, 0x3U, 0X421C819CU, 0x0U
#define IOMUXC_PIO2_24_HSP_eFlexPWM1_PWM_A1                                                     0x421C0060U, 0x4U, 0X421C8128U, 0x0U
#define IOMUXC_PIO2_24_AUDIO_SPDIF_IN                                                           0x421C0060U, 0x5U, 0X421C8044U, 0x0U
#define IOMUXC_PIO2_24_AUDIO_SAI1_RX_SYNC                                                       0x421C0060U, 0x6U, 0X421C801CU, 0x0U
#define IOMUXC_PIO2_24_MEDIA_DCIF_HSYNC                                                         0x421C0060U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_24_HSP_LPSPI1_PCS0                                                          0x421C0060U, 0x9U, 0X421C81CCU, 0x0U
#define IOMUXC_PIO2_24_HSP_XBAR0_INOUT24                                                        0x421C0060U, 0xAU, 0X421C8324U, 0x0U
#define IOMUXC_PIO2_24_HSP_XBAR1_INOUT24                                                        0x421C0060U, 0xBU, 0X421C8394U, 0x0U

#define IOMUXC_PIO2_25_HSP_GPIO0_GPIO25                                                         0x421C0064U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_LPI2C1_SCL                                                           0x421C0064U, 0x1U, 0X421C81A8U, 0x1U
#define IOMUXC_PIO2_25_HSP_FLEXIO0_FXIO_D25                                                     0x421C0064U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_I3C_SCL                                                              0x421C0064U, 0x3U, 0X421C8198U, 0x0U
#define IOMUXC_PIO2_25_HSP_eFlexPWM1_PWM_B1                                                     0x421C0064U, 0x4U, 0X421C8138U, 0x0U
#define IOMUXC_PIO2_25_AUDIO_SPDIF_OUT                                                          0x421C0064U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_AUDIO_SAI1_TX_DATA1                                                      0x421C0064U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_MEDIA_DCIF_VSYNC                                                         0x421C0064U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_FlexCAN1_CAN_TX                                                      0x421C0064U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_25_HSP_LPSPI1_SCK                                                           0x421C0064U, 0x9U, 0X421C81DCU, 0x0U
#define IOMUXC_PIO2_25_HSP_XBAR0_INOUT25                                                        0x421C0064U, 0xAU, 0X421C8328U, 0x0U
#define IOMUXC_PIO2_25_HSP_XBAR1_INOUT25                                                        0x421C0064U, 0xBU, 0X421C8398U, 0x0U

#define IOMUXC_PIO2_26_HSP_GPIO0_GPIO26                                                         0x421C0068U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_FLEXIO0_FXIO_D26                                                     0x421C0068U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_I3C_PUR                                                              0x421C0068U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_eFlexPWM1_PWM_A0                                                     0x421C0068U, 0x4U, 0X421C8124U, 0x0U
#define IOMUXC_PIO2_26_AUDIO_MQS_MQS_LEFT                                                       0x421C0068U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_AUDIO_SAI1_RX_DATA1                                                      0x421C0068U, 0x6U, 0X421C8018U, 0x0U
#define IOMUXC_PIO2_26_MEDIA_DCIF_DE                                                            0x421C0068U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_26_HSP_FlexCAN1_CAN_RX                                                      0x421C0068U, 0x8U, 0X421C8104U, 0x1U
#define IOMUXC_PIO2_26_HSP_LPSPI1_SIN                                                           0x421C0068U, 0x9U, 0X421C81E0U, 0x0U
#define IOMUXC_PIO2_26_HSP_XBAR0_INOUT26                                                        0x421C0068U, 0xAU, 0X421C832CU, 0x0U
#define IOMUXC_PIO2_26_HSP_XBAR1_INOUT26                                                        0x421C0068U, 0xBU, 0X421C839CU, 0x0U

#define IOMUXC_PIO2_27_HSP_GPIO0_GPIO27                                                         0x421C006CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_HSP_FLEXIO0_FXIO_D27                                                     0x421C006CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_COMM_CCM_CLKREF_25M                                                      0x421C006CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_HSP_eFlexPWM1_PWM_B0                                                     0x421C006CU, 0x4U, 0X421C8134U, 0x0U
#define IOMUXC_PIO2_27_AUDIO_MQS_MQS_RIGHT                                                      0x421C006CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_MEDIA_DCIF_PIXEL_CLK                                                     0x421C006CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO2_27_HSP_LPSPI1_SOUT                                                          0x421C006CU, 0x9U, 0X421C81E4U, 0x0U
#define IOMUXC_PIO2_27_HSP_XBAR0_INOUT27                                                        0x421C006CU, 0xAU, 0X421C8330U, 0x0U
#define IOMUXC_PIO2_27_HSP_XBAR1_INOUT27                                                        0x421C006CU, 0xBU, 0X421C83A0U, 0x0U

#define IOMUXC_PIO3_0_HSP_GPIO1_GPIO0                                                           0x421C0080U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_COMM_ENET_QOS_TX_CLK_IO                                                   0x421C0080U, 0x1U, 0X421C8050U, 0x0U
#define IOMUXC_PIO3_0_HSP_FLEXIO1_FXIO_D00                                                      0x421C0080U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_MEDIA_CSI_DATA00                                                          0x421C0080U, 0x4U, 0X421C83F0U, 0x0U
#define IOMUXC_PIO3_0_MAIN_AHB_SRAMC_SRAMC_ADDR00                                               0x421C0080U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_MEDIA_DCIF_DATA00                                                         0x421C0080U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_0_MEDIA_DCIF_DBI_AB_DATA00                                                  0x421C0080U, 0x7U, 0X421C843CU, 0x0U
#define IOMUXC_PIO3_0_HSP_eFlexPWM1_PWM_A0                                                      0x421C0080U, 0x8U, 0X421C8124U, 0x1U
#define IOMUXC_PIO3_0_COMM_ENET_QOS_REF_CLK1                                                    0x421C0080U, 0x9U, 0X421C8048U, 0x0U
#define IOMUXC_PIO3_0_HSP_XBAR0_INOUT00                                                         0x421C0080U, 0xAU, 0X421C82C4U, 0x1U
#define IOMUXC_PIO3_0_HSP_XBAR1_INOUT00                                                         0x421C0080U, 0xBU, 0X421C8334U, 0x1U

#define IOMUXC_PIO3_1_HSP_GPIO1_GPIO1                                                           0x421C0084U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_COMM_ENET_QOS_TX_DATA0                                                    0x421C0084U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_HSP_FLEXIO1_FXIO_D01                                                      0x421C0084U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_MEDIA_CSI_DATA01                                                          0x421C0084U, 0x4U, 0X421C83F4U, 0x0U
#define IOMUXC_PIO3_1_MAIN_AHB_SRAMC_SRAMC_ADDR01                                               0x421C0084U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_MEDIA_DCIF_DATA01                                                         0x421C0084U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_1_MEDIA_DCIF_DBI_AB_DATA01                                                  0x421C0084U, 0x7U, 0X421C8440U, 0x0U
#define IOMUXC_PIO3_1_HSP_eFlexPWM1_PWM_B0                                                      0x421C0084U, 0x8U, 0X421C8134U, 0x1U
#define IOMUXC_PIO3_1_HSP_XBAR0_INOUT01                                                         0x421C0084U, 0xAU, 0X421C82C8U, 0x1U
#define IOMUXC_PIO3_1_HSP_XBAR1_INOUT01                                                         0x421C0084U, 0xBU, 0X421C8338U, 0x1U

#define IOMUXC_PIO3_2_HSP_GPIO1_GPIO2                                                           0x421C0088U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_COMM_ENET_QOS_TX_DATA1                                                    0x421C0088U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_HSP_FLEXIO1_FXIO_D02                                                      0x421C0088U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_COMM_TENBASET_PHY0_TX                                                     0x421C0088U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_MEDIA_CSI_DATA02                                                          0x421C0088U, 0x4U, 0X421C83F8U, 0x0U
#define IOMUXC_PIO3_2_MAIN_AHB_SRAMC_SRAMC_ADDR02                                               0x421C0088U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_MEDIA_DCIF_DATA02                                                         0x421C0088U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_2_MEDIA_DCIF_DBI_AB_DATA02                                                  0x421C0088U, 0x7U, 0X421C8444U, 0x0U
#define IOMUXC_PIO3_2_HSP_eFlexPWM1_PWM_A1                                                      0x421C0088U, 0x8U, 0X421C8128U, 0x1U
#define IOMUXC_PIO3_2_HSP_LPUART0_TXD                                                           0x421C0088U, 0x9U, 0X421C8244U, 0x1U
#define IOMUXC_PIO3_2_HSP_XBAR0_INOUT02                                                         0x421C0088U, 0xAU, 0X421C82CCU, 0x1U
#define IOMUXC_PIO3_2_HSP_XBAR1_INOUT02                                                         0x421C0088U, 0xBU, 0X421C833CU, 0x1U

