zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO3_3_HSP_GPIO1_GPIO3                                                           0x421C008CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_COMM_ENET_QOS_TX_EN                                                       0x421C008CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_HSP_FLEXIO1_FXIO_D03                                                      0x421C008CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_MAIN_XSPI0_ECS                                                            0x421C008CU, 0x3U, 0X421C83ECU, 0x1U
#define IOMUXC_PIO3_3_MEDIA_CSI_DATA03                                                          0x421C008CU, 0x4U, 0X421C83FCU, 0x0U
#define IOMUXC_PIO3_3_MAIN_AHB_SRAMC_SRAMC_ADDR03                                               0x421C008CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_MEDIA_DCIF_DATA03                                                         0x421C008CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_3_MEDIA_DCIF_DBI_AB_DATA03                                                  0x421C008CU, 0x7U, 0X421C8448U, 0x0U
#define IOMUXC_PIO3_3_HSP_eFlexPWM1_PWM_B1                                                      0x421C008CU, 0x8U, 0X421C8138U, 0x1U
#define IOMUXC_PIO3_3_HSP_LPUART0_RXD                                                           0x421C008CU, 0x9U, 0X421C8240U, 0x1U
#define IOMUXC_PIO3_3_HSP_XBAR0_INOUT03                                                         0x421C008CU, 0xAU, 0X421C82D0U, 0x1U
#define IOMUXC_PIO3_3_HSP_XBAR1_INOUT03                                                         0x421C008CU, 0xBU, 0X421C8340U, 0x1U

#define IOMUXC_PIO3_4_HSP_GPIO1_GPIO4                                                           0x421C0090U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_COMM_ENET_QOS_RX_DATA0                                                    0x421C0090U, 0x1U, 0X421C8060U, 0x0U
#define IOMUXC_PIO3_4_HSP_FLEXIO1_FXIO_D04                                                      0x421C0090U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_AUDIO_MICFIL_PDM_CLK                                                      0x421C0090U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_MEDIA_CSI_DATA04                                                          0x421C0090U, 0x4U, 0X421C8400U, 0x0U
#define IOMUXC_PIO3_4_MAIN_AHB_SRAMC_SRAMC_ADDR04                                               0x421C0090U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_MEDIA_DCIF_DATA04                                                         0x421C0090U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_4_MEDIA_DCIF_DBI_AB_DATA04                                                  0x421C0090U, 0x7U, 0X421C844CU, 0x0U
#define IOMUXC_PIO3_4_HSP_eFlexPWM1_PWM_A2                                                      0x421C0090U, 0x8U, 0X421C812CU, 0x1U
#define IOMUXC_PIO3_4_HSP_LPUART0_CTS_B                                                         0x421C0090U, 0x9U, 0X421C823CU, 0x1U
#define IOMUXC_PIO3_4_HSP_XBAR0_INOUT04                                                         0x421C0090U, 0xAU, 0X421C82D4U, 0x1U
#define IOMUXC_PIO3_4_HSP_XBAR1_INOUT04                                                         0x421C0090U, 0xBU, 0X421C8344U, 0x1U

#define IOMUXC_PIO3_5_HSP_GPIO1_GPIO5                                                           0x421C0094U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_COMM_ENET_QOS_RX_DATA1                                                    0x421C0094U, 0x1U, 0X421C8064U, 0x0U
#define IOMUXC_PIO3_5_HSP_FLEXIO1_FXIO_D05                                                      0x421C0094U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_AUDIO_MICFIL_PDM_DATA45                                                   0x421C0094U, 0x3U, 0X421C8008U, 0x1U
#define IOMUXC_PIO3_5_MEDIA_CSI_DATA05                                                          0x421C0094U, 0x4U, 0X421C8404U, 0x0U
#define IOMUXC_PIO3_5_MAIN_AHB_SRAMC_SRAMC_ADDR05                                               0x421C0094U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_MEDIA_DCIF_DATA05                                                         0x421C0094U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_MEDIA_DCIF_DBI_AB_DATA05                                                  0x421C0094U, 0x7U, 0X421C8450U, 0x0U
#define IOMUXC_PIO3_5_HSP_eFlexPWM1_PWM_B2                                                      0x421C0094U, 0x8U, 0X421C813CU, 0x1U
#define IOMUXC_PIO3_5_HSP_LPUART0_RTS_B                                                         0x421C0094U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_5_HSP_XBAR0_INOUT05                                                         0x421C0094U, 0xAU, 0X421C82D8U, 0x1U
#define IOMUXC_PIO3_5_HSP_XBAR1_INOUT05                                                         0x421C0094U, 0xBU, 0X421C8348U, 0x1U

#define IOMUXC_PIO3_6_HSP_GPIO1_GPIO6                                                           0x421C0098U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_COMM_ENET_QOS_CRS                                                         0x421C0098U, 0x1U, 0X421C805CU, 0x0U
#define IOMUXC_PIO3_6_HSP_FLEXIO1_FXIO_D06                                                      0x421C0098U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_AUDIO_MICFIL_PDM_DATA23                                                   0x421C0098U, 0x3U, 0X421C8004U, 0x1U
#define IOMUXC_PIO3_6_MEDIA_CSI_DATA06                                                          0x421C0098U, 0x4U, 0X421C8408U, 0x0U
#define IOMUXC_PIO3_6_MAIN_AHB_SRAMC_SRAMC_ADDR06                                               0x421C0098U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_MEDIA_DCIF_DATA06                                                         0x421C0098U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_6_MEDIA_DCIF_DBI_AB_DATA06                                                  0x421C0098U, 0x7U, 0X421C8454U, 0x0U
#define IOMUXC_PIO3_6_HSP_eFlexPWM1_PWM_A3                                                      0x421C0098U, 0x8U, 0X421C8130U, 0x1U
#define IOMUXC_PIO3_6_HSP_LPUART1_CTS_B                                                         0x421C0098U, 0x9U, 0X421C8248U, 0x1U
#define IOMUXC_PIO3_6_HSP_XBAR0_INOUT06                                                         0x421C0098U, 0xAU, 0X421C82DCU, 0x1U
#define IOMUXC_PIO3_6_HSP_XBAR1_INOUT06                                                         0x421C0098U, 0xBU, 0X421C834CU, 0x1U

#define IOMUXC_PIO3_7_HSP_GPIO1_GPIO7                                                           0x421C009CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_COMM_ENET_QOS_RX_ER                                                       0x421C009CU, 0x1U, 0X421C8074U, 0x0U
#define IOMUXC_PIO3_7_HSP_FLEXIO1_FXIO_D07                                                      0x421C009CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_AUDIO_MICFIL_PDM_DATA01                                                   0x421C009CU, 0x3U, 0X421C8000U, 0x1U
#define IOMUXC_PIO3_7_MEDIA_CSI_DATA07                                                          0x421C009CU, 0x4U, 0X421C840CU, 0x0U
#define IOMUXC_PIO3_7_MAIN_AHB_SRAMC_SRAMC_ADDR07                                               0x421C009CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_MEDIA_DCIF_DATA07                                                         0x421C009CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_MEDIA_DCIF_DBI_AB_DATA07                                                  0x421C009CU, 0x7U, 0X421C8458U, 0x0U
#define IOMUXC_PIO3_7_HSP_eFlexPWM1_PWM_B3                                                      0x421C009CU, 0x8U, 0X421C8140U, 0x1U
#define IOMUXC_PIO3_7_HSP_LPUART1_RTS_B                                                         0x421C009CU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_7_HSP_XBAR0_INOUT07                                                         0x421C009CU, 0xAU, 0X421C82E0U, 0x1U
#define IOMUXC_PIO3_7_HSP_XBAR1_INOUT07                                                         0x421C009CU, 0xBU, 0X421C8350U, 0x1U

#define IOMUXC_PIO3_8_HSP_GPIO1_GPIO8                                                           0x421C00A0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_COMM_ENET_QOS_MDIO                                                        0x421C00A0U, 0x1U, 0X421C8054U, 0x0U
#define IOMUXC_PIO3_8_HSP_FLEXIO1_FXIO_D08                                                      0x421C00A0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_COMM_TENBASET_PHY0_ED                                                     0x421C00A0U, 0x3U, 0X421C80D0U, 0x0U
#define IOMUXC_PIO3_8_MEDIA_CSI_DATA08                                                          0x421C00A0U, 0x4U, 0X421C8410U, 0x0U
#define IOMUXC_PIO3_8_MAIN_AHB_SRAMC_SRAMC_ADDR08                                               0x421C00A0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_MEDIA_DCIF_DATA08                                                         0x421C00A0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_MEDIA_DCIF_DBI_AB_DATA08                                                  0x421C00A0U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_8_HSP_LPI2C1_SDA                                                            0x421C00A0U, 0x8U, 0X421C81ACU, 0x2U
#define IOMUXC_PIO3_8_HSP_LPUART1_TXD                                                           0x421C00A0U, 0x9U, 0X421C8250U, 0x1U
#define IOMUXC_PIO3_8_HSP_XBAR0_INOUT08                                                         0x421C00A0U, 0xAU, 0X421C82E4U, 0x1U
#define IOMUXC_PIO3_8_HSP_XBAR1_INOUT08                                                         0x421C00A0U, 0xBU, 0X421C8354U, 0x1U
#define IOMUXC_PIO3_8_HSP_eFlexPWM2_PWM_A0                                                      0x421C00A0U, 0xCU, 0X421C8148U, 0x0U

#define IOMUXC_PIO3_9_HSP_GPIO1_GPIO9                                                           0x421C00A4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_COMM_ENET_QOS_MDC                                                         0x421C00A4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_HSP_FLEXIO1_FXIO_D09                                                      0x421C00A4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_COMM_TENBASET_PHY0_RX                                                     0x421C00A4U, 0x3U, 0X421C80D4U, 0x0U
#define IOMUXC_PIO3_9_MEDIA_CSI_DATA09                                                          0x421C00A4U, 0x4U, 0X421C8414U, 0x0U
#define IOMUXC_PIO3_9_MAIN_AHB_SRAMC_SRAMC_ADDR09                                               0x421C00A4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_MEDIA_DCIF_DATA09                                                         0x421C00A4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_MEDIA_DCIF_DBI_AB_DATA09                                                  0x421C00A4U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_9_HSP_LPI2C1_SCL                                                            0x421C00A4U, 0x8U, 0X421C81A8U, 0x2U
#define IOMUXC_PIO3_9_HSP_LPUART1_RXD                                                           0x421C00A4U, 0x9U, 0X421C824CU, 0x1U
#define IOMUXC_PIO3_9_HSP_XBAR0_INOUT09                                                         0x421C00A4U, 0xAU, 0X421C82E8U, 0x1U
#define IOMUXC_PIO3_9_HSP_XBAR1_INOUT09                                                         0x421C00A4U, 0xBU, 0X421C8358U, 0x1U
#define IOMUXC_PIO3_9_HSP_eFlexPWM2_PWM_B0                                                      0x421C00A4U, 0xCU, 0X421C8158U, 0x0U

#define IOMUXC_PIO3_10_HSP_GPIO1_GPIO10                                                         0x421C00A8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_COMM_ENET_QOS_TX_DATA2                                                   0x421C00A8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_HSP_FLEXIO1_FXIO_D10                                                     0x421C00A8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_AUDIO_SAI1_MCLK                                                          0x421C00A8U, 0x3U, 0X421C800CU, 0x2U
#define IOMUXC_PIO3_10_MEDIA_CSI_DATA10                                                         0x421C00A8U, 0x4U, 0X421C8418U, 0x0U
#define IOMUXC_PIO3_10_MAIN_AHB_SRAMC_SRAMC_ADDR10                                              0x421C00A8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_MEDIA_DCIF_DATA10                                                        0x421C00A8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_MEDIA_DCIF_DBI_AB_DATA10                                                 0x421C00A8U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_10_HSP_LPSPI1_PCS3                                                          0x421C00A8U, 0x8U, 0X421C81D8U, 0x1U
#define IOMUXC_PIO3_10_HSP_LPUART2_CTS_B                                                        0x421C00A8U, 0x9U, 0X421C8254U, 0x1U
#define IOMUXC_PIO3_10_HSP_XBAR0_INOUT10                                                        0x421C00A8U, 0xAU, 0X421C82ECU, 0x1U
#define IOMUXC_PIO3_10_HSP_XBAR1_INOUT10                                                        0x421C00A8U, 0xBU, 0X421C835CU, 0x1U
#define IOMUXC_PIO3_10_HSP_eFlexPWM2_PWM_A1                                                     0x421C00A8U, 0xCU, 0X421C814CU, 0x0U

#define IOMUXC_PIO3_11_HSP_GPIO1_GPIO11                                                         0x421C00ACU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_COMM_ENET_QOS_TX_DATA3                                                   0x421C00ACU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_HSP_FLEXIO1_FXIO_D11                                                     0x421C00ACU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_AUDIO_SAI1_TX_BCLK                                                       0x421C00ACU, 0x3U, 0X421C8020U, 0x1U
#define IOMUXC_PIO3_11_MEDIA_CSI_DATA11                                                         0x421C00ACU, 0x4U, 0X421C841CU, 0x0U
#define IOMUXC_PIO3_11_MAIN_AHB_SRAMC_SRAMC_ADDR11                                              0x421C00ACU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_MEDIA_DCIF_DATA11                                                        0x421C00ACU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_MEDIA_DCIF_DBI_AB_DATA11                                                 0x421C00ACU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_HSP_LPSPI1_PCS2                                                          0x421C00ACU, 0x8U, 0X421C81D4U, 0x1U
#define IOMUXC_PIO3_11_HSP_LPUART2_RTS_B                                                        0x421C00ACU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_11_HSP_XBAR0_INOUT11                                                        0x421C00ACU, 0xAU, 0X421C82F0U, 0x1U
#define IOMUXC_PIO3_11_HSP_XBAR1_INOUT11                                                        0x421C00ACU, 0xBU, 0X421C8360U, 0x1U
#define IOMUXC_PIO3_11_HSP_eFlexPWM2_PWM_B1                                                     0x421C00ACU, 0xCU, 0X421C815CU, 0x0U

#define IOMUXC_PIO3_12_HSP_GPIO1_GPIO12                                                         0x421C00B0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_COMM_ENET_QOS_TX_ER                                                      0x421C00B0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_HSP_FLEXIO1_FXIO_D12                                                     0x421C00B0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_AUDIO_SAI1_TX_SYNC                                                       0x421C00B0U, 0x3U, 0X421C8024U, 0x1U
#define IOMUXC_PIO3_12_MEDIA_CSI_DATA12                                                         0x421C00B0U, 0x4U, 0X421C8420U, 0x0U
#define IOMUXC_PIO3_12_MAIN_AHB_SRAMC_SRAMC_ADDR12                                              0x421C00B0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_MEDIA_DCIF_DATA12                                                        0x421C00B0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_MEDIA_DCIF_DBI_AB_DATA12                                                 0x421C00B0U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_12_HSP_LPSPI1_PCS1                                                          0x421C00B0U, 0x8U, 0X421C81D0U, 0x1U
#define IOMUXC_PIO3_12_HSP_LPUART2_TXD                                                          0x421C00B0U, 0x9U, 0X421C825CU, 0x1U
#define IOMUXC_PIO3_12_HSP_XBAR0_INOUT12                                                        0x421C00B0U, 0xAU, 0X421C82F4U, 0x1U
#define IOMUXC_PIO3_12_HSP_XBAR1_INOUT12                                                        0x421C00B0U, 0xBU, 0X421C8364U, 0x1U
#define IOMUXC_PIO3_12_HSP_eFlexPWM2_PWM_A3                                                     0x421C00B0U, 0xCU, 0X421C8154U, 0x0U

