zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO3_13_HSP_GPIO1_GPIO13                                                         0x421C00B4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_COMM_ENET_QOS_RX_CLK                                                     0x421C00B4U, 0x1U, 0X421C804CU, 0x0U
#define IOMUXC_PIO3_13_HSP_FLEXIO1_FXIO_D13                                                     0x421C00B4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_AUDIO_SAI1_TX_DATA0                                                      0x421C00B4U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_MEDIA_CSI_DATA13                                                         0x421C00B4U, 0x4U, 0X421C8424U, 0x0U
#define IOMUXC_PIO3_13_MAIN_AHB_SRAMC_SRAMC_ADDR13                                              0x421C00B4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_MEDIA_DCIF_DATA13                                                        0x421C00B4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_MEDIA_DCIF_DBI_AB_DATA13                                                 0x421C00B4U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_13_HSP_LPSPI1_PCS0                                                          0x421C00B4U, 0x8U, 0X421C81CCU, 0x1U
#define IOMUXC_PIO3_13_HSP_LPUART2_RXD                                                          0x421C00B4U, 0x9U, 0X421C8258U, 0x1U
#define IOMUXC_PIO3_13_HSP_XBAR0_INOUT13                                                        0x421C00B4U, 0xAU, 0X421C82F8U, 0x1U
#define IOMUXC_PIO3_13_HSP_XBAR1_INOUT13                                                        0x421C00B4U, 0xBU, 0X421C8368U, 0x1U
#define IOMUXC_PIO3_13_HSP_eFlexPWM2_PWM_B3                                                     0x421C00B4U, 0xCU, 0X421C8164U, 0x0U

#define IOMUXC_PIO3_14_HSP_GPIO1_GPIO14                                                         0x421C00B8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_COMM_ENET_QOS_RX_DATA2                                                   0x421C00B8U, 0x1U, 0X421C8068U, 0x0U
#define IOMUXC_PIO3_14_HSP_FLEXIO1_FXIO_D14                                                     0x421C00B8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_AUDIO_SAI1_RX_DATA0                                                      0x421C00B8U, 0x3U, 0X421C8014U, 0x1U
#define IOMUXC_PIO3_14_MEDIA_CSI_DATA14                                                         0x421C00B8U, 0x4U, 0X421C8428U, 0x0U
#define IOMUXC_PIO3_14_MAIN_AHB_SRAMC_SRAMC_ADDR14                                              0x421C00B8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_MEDIA_DCIF_DATA14                                                        0x421C00B8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_MEDIA_DCIF_DBI_AB_DATA14                                                 0x421C00B8U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_14_HSP_LPSPI1_SCK                                                           0x421C00B8U, 0x8U, 0X421C81DCU, 0x1U
#define IOMUXC_PIO3_14_HSP_LPUART3_CTS_B                                                        0x421C00B8U, 0x9U, 0X421C8260U, 0x1U
#define IOMUXC_PIO3_14_HSP_XBAR0_INOUT14                                                        0x421C00B8U, 0xAU, 0X421C82FCU, 0x1U
#define IOMUXC_PIO3_14_HSP_XBAR1_INOUT14                                                        0x421C00B8U, 0xBU, 0X421C836CU, 0x1U

#define IOMUXC_PIO3_15_HSP_GPIO1_GPIO15                                                         0x421C00BCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_COMM_ENET_QOS_RX_DATA3                                                   0x421C00BCU, 0x1U, 0X421C806CU, 0x0U
#define IOMUXC_PIO3_15_HSP_FLEXIO1_FXIO_D15                                                     0x421C00BCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_AUDIO_SAI1_RX_BCLK                                                       0x421C00BCU, 0x3U, 0X421C8010U, 0x1U
#define IOMUXC_PIO3_15_MEDIA_CSI_DATA15                                                         0x421C00BCU, 0x4U, 0X421C842CU, 0x0U
#define IOMUXC_PIO3_15_MAIN_AHB_SRAMC_SRAMC_ADDR15                                              0x421C00BCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_MEDIA_DCIF_DATA15                                                        0x421C00BCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_MEDIA_DCIF_DBI_AB_DATA15                                                 0x421C00BCU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_HSP_LPSPI1_SOUT                                                          0x421C00BCU, 0x8U, 0X421C81E4U, 0x1U
#define IOMUXC_PIO3_15_HSP_LPUART3_RTS_B                                                        0x421C00BCU, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_15_HSP_XBAR0_INOUT15                                                        0x421C00BCU, 0xAU, 0X421C8300U, 0x1U
#define IOMUXC_PIO3_15_HSP_XBAR1_INOUT15                                                        0x421C00BCU, 0xBU, 0X421C8370U, 0x1U

#define IOMUXC_PIO3_16_HSP_GPIO1_GPIO16                                                         0x421C00C0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_COMM_ENET_QOS_RX_EN                                                      0x421C00C0U, 0x1U, 0X421C8070U, 0x0U
#define IOMUXC_PIO3_16_HSP_FLEXIO1_FXIO_D16                                                     0x421C00C0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_AUDIO_SAI1_RX_SYNC                                                       0x421C00C0U, 0x3U, 0X421C801CU, 0x1U
#define IOMUXC_PIO3_16_MEDIA_CSI_MCLK                                                           0x421C00C0U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_MAIN_AHB_SRAMC_SRAMC_ADDR16                                              0x421C00C0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_MEDIA_DCIF_DATA16                                                        0x421C00C0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_MEDIA_DCIF_DBI_AB_CSX                                                    0x421C00C0U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_16_HSP_LPSPI1_SIN                                                           0x421C00C0U, 0x8U, 0X421C81E0U, 0x1U
#define IOMUXC_PIO3_16_HSP_LPUART3_TXD                                                          0x421C00C0U, 0x9U, 0X421C8268U, 0x1U
#define IOMUXC_PIO3_16_HSP_XBAR0_INOUT16                                                        0x421C00C0U, 0xAU, 0X421C8304U, 0x1U
#define IOMUXC_PIO3_16_HSP_XBAR1_INOUT16                                                        0x421C00C0U, 0xBU, 0X421C8374U, 0x1U

#define IOMUXC_PIO3_17_HSP_GPIO1_GPIO17                                                         0x421C00C4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_COMM_ENET_QOS_COL                                                        0x421C00C4U, 0x1U, 0X421C8058U, 0x0U
#define IOMUXC_PIO3_17_HSP_FLEXIO1_FXIO_D17                                                     0x421C00C4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_AUDIO_SAI1_TX_DATA1                                                      0x421C00C4U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_MEDIA_CSI_HSYNC                                                          0x421C00C4U, 0x4U, 0X421C8430U, 0x0U
#define IOMUXC_PIO3_17_MAIN_AHB_SRAMC_SRAMC_ADVB                                                0x421C00C4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_MEDIA_DCIF_DATA17                                                        0x421C00C4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_MEDIA_DCIF_DBI_AB_DCS                                                    0x421C00C4U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_17_HSP_LPSPI0_PCS3                                                          0x421C00C4U, 0x8U, 0X421C81BCU, 0x1U
#define IOMUXC_PIO3_17_HSP_LPUART3_RXD                                                          0x421C00C4U, 0x9U, 0X421C8264U, 0x1U
#define IOMUXC_PIO3_17_HSP_XBAR0_INOUT17                                                        0x421C00C4U, 0xAU, 0X421C8308U, 0x1U
#define IOMUXC_PIO3_17_HSP_XBAR1_INOUT17                                                        0x421C00C4U, 0xBU, 0X421C8378U, 0x1U
#define IOMUXC_PIO3_17_AUDIO_MQS_MQS_LEFT                                                       0x421C00C4U, 0xCU, 0x00000000U, 0x0U

#define IOMUXC_PIO3_18_HSP_GPIO1_GPIO18                                                         0x421C00C8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_WAKE_EWM_OUT_B                                                           0x421C00C8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_HSP_FLEXIO1_FXIO_D18                                                     0x421C00C8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_AUDIO_SAI1_RX_DATA1                                                      0x421C00C8U, 0x3U, 0X421C8018U, 0x1U
#define IOMUXC_PIO3_18_MEDIA_CSI_VSYNC                                                          0x421C00C8U, 0x4U, 0X421C8438U, 0x0U
#define IOMUXC_PIO3_18_MAIN_AHB_SRAMC_SRAMC_CS0                                                 0x421C00C8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_MEDIA_DCIF_DATA18                                                        0x421C00C8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_MEDIA_DCIF_DBI_B_RDX                                                     0x421C00C8U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_HSP_LPSPI0_PCS2                                                          0x421C00C8U, 0x8U, 0X421C81B8U, 0x1U
#define IOMUXC_PIO3_18_MEDIA_DCIF_DBI_A_E                                                       0x421C00C8U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_18_HSP_XBAR0_INOUT18                                                        0x421C00C8U, 0xAU, 0X421C830CU, 0x1U
#define IOMUXC_PIO3_18_HSP_XBAR1_INOUT18                                                        0x421C00C8U, 0xBU, 0X421C837CU, 0x1U
#define IOMUXC_PIO3_18_AUDIO_MQS_MQS_RIGHT                                                      0x421C00C8U, 0xCU, 0x00000000U, 0x0U

