zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO3_19_HSP_GPIO1_GPIO19                                                         0x421C00CCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_HSP_FLEXIO1_FXIO_D19                                                     0x421C00CCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_COMM_CCM_CLKREF_25M                                                      0x421C00CCU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_MEDIA_CSI_PIXCLK                                                         0x421C00CCU, 0x4U, 0X421C8434U, 0x0U
#define IOMUXC_PIO3_19_MAIN_AHB_SRAMC_SRAMC_CS1                                                 0x421C00CCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_MEDIA_DCIF_DATA19                                                        0x421C00CCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_MEDIA_DCIF_DBI_A_RWX_OR_B_WRX                                              0x421C00CCU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_19_HSP_LPSPI0_PCS1                                                          0x421C00CCU, 0x8U, 0X421C81B4U, 0x1U
#define IOMUXC_PIO3_19_AUDIO_MICFIL_PDM_DATA45                                                  0x421C00CCU, 0x9U, 0X421C8008U, 0x2U
#define IOMUXC_PIO3_19_HSP_XBAR0_INOUT19                                                        0x421C00CCU, 0xAU, 0X421C8310U, 0x1U
#define IOMUXC_PIO3_19_HSP_XBAR1_INOUT19                                                        0x421C00CCU, 0xBU, 0X421C8380U, 0x1U

#define IOMUXC_PIO3_20_HSP_GPIO1_GPIO20                                                         0x421C00D0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_HSP_FLEXIO1_FXIO_D20                                                     0x421C00D0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_SYSCON_FREQME_CLK_OUT                                                    0x421C00D0U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_MEDIA_CSI_FIELD                                                          0x421C00D0U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_MAIN_AHB_SRAMC_SRAMC_WP0                                                 0x421C00D0U, 0x5U, 0X421C83E4U, 0x1U
#define IOMUXC_PIO3_20_MEDIA_DCIF_DATA20                                                        0x421C00D0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_20_HSP_LPI2C0_SCL                                                           0x421C00D0U, 0x7U, 0X421C81A0U, 0x2U
#define IOMUXC_PIO3_20_HSP_LPSPI0_SCK                                                           0x421C00D0U, 0x8U, 0X421C81C0U, 0x1U
#define IOMUXC_PIO3_20_AUDIO_MICFIL_PDM_DATA23                                                  0x421C00D0U, 0x9U, 0X421C8004U, 0x2U
#define IOMUXC_PIO3_20_HSP_XBAR0_INOUT20                                                        0x421C00D0U, 0xAU, 0X421C8314U, 0x1U
#define IOMUXC_PIO3_20_HSP_XBAR1_INOUT20                                                        0x421C00D0U, 0xBU, 0X421C8384U, 0x1U

#define IOMUXC_PIO3_21_HSP_GPIO1_GPIO21                                                         0x421C00D4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_HSP_FLEXIO1_FXIO_D21                                                     0x421C00D4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_MEDIA_FREQME_CLK_OUT                                                     0x421C00D4U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_COMM_USB0_ID                                                             0x421C00D4U, 0x4U, 0X421C80A8U, 0x1U
#define IOMUXC_PIO3_21_MAIN_AHB_SRAMC_SRAMC_WP1                                                 0x421C00D4U, 0x5U, 0X421C83E8U, 0x1U
#define IOMUXC_PIO3_21_MEDIA_DCIF_DATA21                                                        0x421C00D4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_21_HSP_LPI2C0_SDA                                                           0x421C00D4U, 0x7U, 0X421C81A4U, 0x2U
#define IOMUXC_PIO3_21_HSP_LPSPI0_SOUT                                                          0x421C00D4U, 0x8U, 0X421C81C8U, 0x1U
#define IOMUXC_PIO3_21_AUDIO_MICFIL_PDM_DATA01                                                  0x421C00D4U, 0x9U, 0X421C8000U, 0x2U
#define IOMUXC_PIO3_21_HSP_XBAR0_INOUT21                                                        0x421C00D4U, 0xAU, 0X421C8318U, 0x1U
#define IOMUXC_PIO3_21_HSP_XBAR1_INOUT21                                                        0x421C00D4U, 0xBU, 0X421C8388U, 0x1U
#define IOMUXC_PIO3_21_HSP_eFlexPWM2_PWM_X0                                                     0x421C00D4U, 0xCU, 0X421C8168U, 0x0U

#define IOMUXC_PIO3_22_HSP_GPIO1_GPIO22                                                         0x421C00D8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_FLEXIO1_FXIO_D22                                                     0x421C00D8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_COMM_FREQME_CLK_OUT                                                      0x421C00D8U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_COMM_uSDHC1_CD_B                                                         0x421C00D8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_MEDIA_DCIF_DATA22                                                        0x421C00D8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_FlexCAN2_CAN_TX                                                      0x421C00D8U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_LPSPI0_SIN                                                           0x421C00D8U, 0x8U, 0X421C81C4U, 0x1U
#define IOMUXC_PIO3_22_AUDIO_MICFIL_PDM_CLK                                                     0x421C00D8U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_22_HSP_XBAR0_INOUT22                                                        0x421C00D8U, 0xAU, 0X421C831CU, 0x1U
#define IOMUXC_PIO3_22_HSP_XBAR1_INOUT22                                                        0x421C00D8U, 0xBU, 0X421C838CU, 0x1U
#define IOMUXC_PIO3_22_HSP_eFlexPWM2_PWM_X1                                                     0x421C00D8U, 0xCU, 0X421C816CU, 0x0U

#define IOMUXC_PIO3_23_HSP_GPIO1_GPIO23                                                         0x421C00DCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_HSP_FLEXIO1_FXIO_D23                                                     0x421C00DCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_MAIN_TRACE_SWO                                                           0x421C00DCU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_COMM_USB0_PWR                                                            0x421C00DCU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_COMM_uSDHC1_RESET_B                                                      0x421C00DCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_MEDIA_DCIF_DATA23                                                        0x421C00DCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_23_HSP_FlexCAN2_CAN_RX                                                      0x421C00DCU, 0x7U, 0X421C8108U, 0x0U
#define IOMUXC_PIO3_23_HSP_LPSPI0_PCS0                                                          0x421C00DCU, 0x8U, 0X421C81B0U, 0x1U
#define IOMUXC_PIO3_23_HSP_XBAR0_INOUT23                                                        0x421C00DCU, 0xAU, 0X421C8320U, 0x1U
#define IOMUXC_PIO3_23_HSP_XBAR1_INOUT23                                                        0x421C00DCU, 0xBU, 0X421C8390U, 0x1U
#define IOMUXC_PIO3_23_HSP_eFlexPWM2_PWM_X2                                                     0x421C00DCU, 0xCU, 0X421C8170U, 0x0U

