zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO3_24_HSP_GPIO1_GPIO24                                                         0x421C00E0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_24_HSP_FLEXIO1_FXIO_D24                                                     0x421C00E0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_24_MAIN_CCM_CLKOUT                                                          0x421C00E0U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_24_COMM_USB0_OC                                                             0x421C00E0U, 0x4U, 0X421C80A4U, 0x1U
#define IOMUXC_PIO3_24_COMM_uSDHC1_WP                                                           0x421C00E0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_24_MEDIA_DCIF_DE                                                            0x421C00E0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_24_HSP_LPI2C0_SDA                                                           0x421C00E0U, 0x8U, 0X421C81A4U, 0x3U
#define IOMUXC_PIO3_24_HSP_XBAR0_INOUT24                                                        0x421C00E0U, 0xAU, 0X421C8324U, 0x1U
#define IOMUXC_PIO3_24_HSP_XBAR1_INOUT24                                                        0x421C00E0U, 0xBU, 0X421C8394U, 0x1U
#define IOMUXC_PIO3_24_HSP_eFlexPWM2_PWM_X3                                                     0x421C00E0U, 0xCU, 0X421C8174U, 0x0U

#define IOMUXC_PIO3_25_HSP_GPIO1_GPIO25                                                         0x421C00E4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_25_HSP_FLEXIO1_FXIO_D25                                                     0x421C00E4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_25_HSP_I3C_SDA                                                              0x421C00E4U, 0x3U, 0X421C819CU, 0x1U
#define IOMUXC_PIO3_25_MEDIA_DCIF_PIXEL_CLK                                                     0x421C00E4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_25_HSP_LPI2C0_SCL                                                           0x421C00E4U, 0x8U, 0X421C81A0U, 0x3U
#define IOMUXC_PIO3_25_HSP_XBAR0_INOUT25                                                        0x421C00E4U, 0xAU, 0X421C8328U, 0x1U
#define IOMUXC_PIO3_25_HSP_XBAR1_INOUT25                                                        0x421C00E4U, 0xBU, 0X421C8398U, 0x1U

#define IOMUXC_PIO3_26_HSP_GPIO1_GPIO26                                                         0x421C00E8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_26_HSP_FLEXIO1_FXIO_D26                                                     0x421C00E8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_26_HSP_I3C_SCL                                                              0x421C00E8U, 0x3U, 0X421C8198U, 0x1U
#define IOMUXC_PIO3_26_MEDIA_DCIF_HSYNC                                                         0x421C00E8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_26_AUDIO_MQS_MQS_LEFT                                                       0x421C00E8U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_26_HSP_XBAR0_INOUT26                                                        0x421C00E8U, 0xAU, 0X421C832CU, 0x1U
#define IOMUXC_PIO3_26_HSP_XBAR1_INOUT26                                                        0x421C00E8U, 0xBU, 0X421C839CU, 0x1U

#define IOMUXC_PIO3_27_HSP_GPIO1_GPIO27                                                         0x421C00ECU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_27_HSP_FLEXIO1_FXIO_D27                                                     0x421C00ECU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_27_HSP_I3C_PUR                                                              0x421C00ECU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_27_MEDIA_DCIF_VSYNC                                                         0x421C00ECU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_27_AUDIO_MQS_MQS_RIGHT                                                      0x421C00ECU, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_27_HSP_XBAR0_INOUT27                                                        0x421C00ECU, 0xAU, 0X421C8330U, 0x1U
#define IOMUXC_PIO3_27_HSP_XBAR1_INOUT27                                                        0x421C00ECU, 0xBU, 0X421C83A0U, 0x1U

#define IOMUXC_PIO3_28_HSP_GPIO1_GPIO28                                                         0x421C00F0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_28_HSP_LPUART0_CTS_B                                                        0x421C00F0U, 0x1U, 0X421C823CU, 0x2U
#define IOMUXC_PIO3_28_HSP_FLEXIO1_FXIO_D28                                                     0x421C00F0U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_28_MAIN_CCM_CLKOUT                                                          0x421C00F0U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_28_HSP_eFlexPWM1_PWM_X1                                                     0x421C00F0U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_28_COMM_ENET_TX_ER                                                          0x421C00F0U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_28_COMM_uSDHC0_RESET_B                                                      0x421C00F0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_28_HSP_XBAR0_INOUT28                                                        0x421C00F0U, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_28_HSP_XBAR1_INOUT28                                                        0x421C00F0U, 0xBU, 0x00000000U, 0x0U

#define IOMUXC_PIO3_29_HSP_GPIO1_GPIO29                                                         0x421C00F4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_29_HSP_LPUART0_RTS_B                                                        0x421C00F4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_29_HSP_FLEXIO1_FXIO_D29                                                     0x421C00F4U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_29_CMPT_FREQME_CLK_OUT                                                      0x421C00F4U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_29_HSP_eFlexPWM1_PWM_X2                                                     0x421C00F4U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_29_COMM_ENET_RX_ER                                                          0x421C00F4U, 0x5U, 0X421C80A0U, 0x0U
#define IOMUXC_PIO3_29_COMM_uSDHC0_CD_B                                                         0x421C00F4U, 0x6U, 0X421C80B0U, 0x0U
#define IOMUXC_PIO3_29_HSP_XBAR0_INOUT29                                                        0x421C00F4U, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_29_HSP_XBAR1_INOUT29                                                        0x421C00F4U, 0xBU, 0x00000000U, 0x0U

