zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO3_30_HSP_GPIO1_GPIO30                                                         0x421C00F8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_HSP_LPUART0_TXD                                                          0x421C00F8U, 0x1U, 0X421C8244U, 0x2U
#define IOMUXC_PIO3_30_HSP_FLEXIO1_FXIO_D30                                                     0x421C00F8U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_HSP_eFlexPWM1_PWM_X3                                                     0x421C00F8U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_COMM_ENET_CRS                                                            0x421C00F8U, 0x5U, 0X421C8080U, 0x0U
#define IOMUXC_PIO3_30_COMM_uSDHC0_WP                                                           0x421C00F8U, 0x6U, 0X421C80B4U, 0x0U
#define IOMUXC_PIO3_30_HSP_XBAR0_INOUT30                                                        0x421C00F8U, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_HSP_XBAR1_INOUT30                                                        0x421C00F8U, 0xBU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_30_MAIN_XSPI0_TST_TRG                                                       0x421C00F8U, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO3_31_HSP_GPIO1_GPIO31                                                         0x421C00FCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_HSP_LPUART0_RXD                                                          0x421C00FCU, 0x1U, 0X421C8240U, 0x2U
#define IOMUXC_PIO3_31_HSP_FLEXIO1_FXIO_D31                                                     0x421C00FCU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_MAIN_FREQME_CLK_OUT                                                      0x421C00FCU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_COMM_CCM_CLKREF_25M                                                      0x421C00FCU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_COMM_ENET_COL                                                            0x421C00FCU, 0x5U, 0X421C807CU, 0x0U
#define IOMUXC_PIO3_31_COMM_uSDHC0_VSELECT                                                      0x421C00FCU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_HSP_XBAR0_INOUT31                                                        0x421C00FCU, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_HSP_XBAR1_INOUT31                                                        0x421C00FCU, 0xBU, 0x00000000U, 0x0U
#define IOMUXC_PIO3_31_MAIN_XSPI1_TST_TRG                                                       0x421C00FCU, 0xFU, 0x00000000U, 0x0U

#define IOMUXC_PIO4_0_HSP_GPIO2_GPIO0                                                           0x421C0100U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_COMM_ENET_TX_CLK_IO                                                       0x421C0100U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_HSP_FLEXIO2_FXIO_D00                                                      0x421C0100U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_AUDIO_SAI2_MCLK                                                           0x421C0100U, 0x3U, 0X421C8028U, 0x0U
#define IOMUXC_PIO4_0_MEDIA_CSI_DATA23                                                          0x421C0100U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_HSP_SINC1_MBIT0                                                           0x421C0100U, 0x5U, 0X421C82A4U, 0x0U
#define IOMUXC_PIO4_0_MEDIA_DCIF_DATA00                                                         0x421C0100U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_0_MEDIA_DCIF_DBI_AB_DATA00                                                  0x421C0100U, 0x7U, 0X421C843CU, 0x1U
#define IOMUXC_PIO4_0_HSP_eFlexPWM2_PWM_A0                                                      0x421C0100U, 0x8U, 0X421C8148U, 0x1U
#define IOMUXC_PIO4_0_COMM_ENET_REF_CLK                                                         0x421C0100U, 0x9U, 0X421C8078U, 0x0U
#define IOMUXC_PIO4_0_HSP_XBAR0_INOUT00                                                         0x421C0100U, 0xAU, 0X421C82C4U, 0x2U
#define IOMUXC_PIO4_0_HSP_XBAR1_INOUT00                                                         0x421C0100U, 0xBU, 0X421C8334U, 0x2U

#define IOMUXC_PIO4_1_HSP_GPIO2_GPIO1                                                           0x421C0104U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_COMM_ENET_TXD0                                                            0x421C0104U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_HSP_FLEXIO2_FXIO_D01                                                      0x421C0104U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_AUDIO_SAI2_TX_BCLK                                                        0x421C0104U, 0x3U, 0X421C803CU, 0x0U
#define IOMUXC_PIO4_1_MEDIA_CSI_DATA22                                                          0x421C0104U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_HSP_SINC1_MCLK0                                                           0x421C0104U, 0x5U, 0X421C82B4U, 0x0U
#define IOMUXC_PIO4_1_MEDIA_DCIF_DATA01                                                         0x421C0104U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_MEDIA_DCIF_DBI_AB_DATA01                                                  0x421C0104U, 0x7U, 0X421C8440U, 0x1U
#define IOMUXC_PIO4_1_HSP_eFlexPWM2_PWM_B0                                                      0x421C0104U, 0x8U, 0X421C8158U, 0x1U
#define IOMUXC_PIO4_1_HSP_SINC1_MCLK_OUT0                                                       0x421C0104U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_1_HSP_XBAR0_INOUT01                                                         0x421C0104U, 0xAU, 0X421C82C8U, 0x2U
#define IOMUXC_PIO4_1_HSP_XBAR1_INOUT01                                                         0x421C0104U, 0xBU, 0X421C8338U, 0x2U

#define IOMUXC_PIO4_2_HSP_GPIO2_GPIO2                                                           0x421C0108U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_COMM_ENET_TXD1                                                            0x421C0108U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_HSP_FLEXIO2_FXIO_D02                                                      0x421C0108U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_AUDIO_SAI2_TX_SYNC                                                        0x421C0108U, 0x3U, 0X421C8040U, 0x0U
#define IOMUXC_PIO4_2_MEDIA_CSI_DATA21                                                          0x421C0108U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_HSP_SINC1_MCLK1                                                           0x421C0108U, 0x5U, 0X421C82B8U, 0x0U
#define IOMUXC_PIO4_2_MEDIA_DCIF_DATA02                                                         0x421C0108U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_MEDIA_DCIF_DBI_AB_DATA02                                                  0x421C0108U, 0x7U, 0X421C8444U, 0x1U
#define IOMUXC_PIO4_2_HSP_eFlexPWM2_PWM_A1                                                      0x421C0108U, 0x8U, 0X421C814CU, 0x1U
#define IOMUXC_PIO4_2_HSP_SINC1_MCLK_OUT1                                                       0x421C0108U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_2_HSP_XBAR0_INOUT02                                                         0x421C0108U, 0xAU, 0X421C82CCU, 0x2U
#define IOMUXC_PIO4_2_HSP_XBAR1_INOUT02                                                         0x421C0108U, 0xBU, 0X421C833CU, 0x2U

#define IOMUXC_PIO4_3_HSP_GPIO2_GPIO3                                                           0x421C010CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_COMM_ENET_TX_EN                                                           0x421C010CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_HSP_FLEXIO2_FXIO_D03                                                      0x421C010CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_AUDIO_SAI2_RX_DATA0                                                       0x421C010CU, 0x3U, 0X421C8030U, 0x0U
#define IOMUXC_PIO4_3_MEDIA_CSI_DATA20                                                          0x421C010CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_HSP_SINC1_MBIT1                                                           0x421C010CU, 0x5U, 0X421C82A8U, 0x0U
#define IOMUXC_PIO4_3_MEDIA_DCIF_DATA03                                                         0x421C010CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_3_MEDIA_DCIF_DBI_AB_DATA03                                                  0x421C010CU, 0x7U, 0X421C8448U, 0x1U
#define IOMUXC_PIO4_3_HSP_eFlexPWM2_PWM_B1                                                      0x421C010CU, 0x8U, 0X421C815CU, 0x1U
#define IOMUXC_PIO4_3_HSP_XBAR0_INOUT03                                                         0x421C010CU, 0xAU, 0X421C82D0U, 0x2U
#define IOMUXC_PIO4_3_HSP_XBAR1_INOUT03                                                         0x421C010CU, 0xBU, 0X421C8340U, 0x2U

#define IOMUXC_PIO4_4_HSP_GPIO2_GPIO4                                                           0x421C0110U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_COMM_ENET_RXD0                                                            0x421C0110U, 0x1U, 0X421C808CU, 0x0U
#define IOMUXC_PIO4_4_HSP_FLEXIO2_FXIO_D04                                                      0x421C0110U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_AUDIO_SAI2_TX_DATA0                                                       0x421C0110U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_MEDIA_CSI_DATA19                                                          0x421C0110U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_HSP_SINC1_MCLK2                                                           0x421C0110U, 0x5U, 0X421C82BCU, 0x0U
#define IOMUXC_PIO4_4_MEDIA_DCIF_DATA04                                                         0x421C0110U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_MEDIA_DCIF_DBI_AB_DATA04                                                  0x421C0110U, 0x7U, 0X421C844CU, 0x1U
#define IOMUXC_PIO4_4_HSP_eFlexPWM2_PWM_A2                                                      0x421C0110U, 0x8U, 0X421C8150U, 0x0U
#define IOMUXC_PIO4_4_HSP_SINC1_MCLK_OUT2                                                       0x421C0110U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_4_HSP_XBAR0_INOUT04                                                         0x421C0110U, 0xAU, 0X421C82D4U, 0x2U
#define IOMUXC_PIO4_4_HSP_XBAR1_INOUT04                                                         0x421C0110U, 0xBU, 0X421C8344U, 0x2U

#define IOMUXC_PIO4_5_HSP_GPIO2_GPIO5                                                           0x421C0114U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_COMM_ENET_RXD1                                                            0x421C0114U, 0x1U, 0X421C8090U, 0x0U
#define IOMUXC_PIO4_5_HSP_FLEXIO2_FXIO_D05                                                      0x421C0114U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_AUDIO_SAI2_RX_BCLK                                                        0x421C0114U, 0x3U, 0X421C802CU, 0x0U
#define IOMUXC_PIO4_5_MEDIA_CSI_DATA18                                                          0x421C0114U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_HSP_SINC1_MBIT2                                                           0x421C0114U, 0x5U, 0X421C82ACU, 0x0U
#define IOMUXC_PIO4_5_MEDIA_DCIF_DATA05                                                         0x421C0114U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_5_MEDIA_DCIF_DBI_AB_DATA05                                                  0x421C0114U, 0x7U, 0X421C8450U, 0x1U
#define IOMUXC_PIO4_5_HSP_eFlexPWM2_PWM_B2                                                      0x421C0114U, 0x8U, 0X421C8160U, 0x0U
#define IOMUXC_PIO4_5_HSP_XBAR0_INOUT05                                                         0x421C0114U, 0xAU, 0X421C82D8U, 0x2U
#define IOMUXC_PIO4_5_HSP_XBAR1_INOUT05                                                         0x421C0114U, 0xBU, 0X421C8348U, 0x2U

#define IOMUXC_PIO4_6_HSP_GPIO2_GPIO6                                                           0x421C0118U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_COMM_ENET_MDIO                                                            0x421C0118U, 0x1U, 0X421C8084U, 0x0U
#define IOMUXC_PIO4_6_HSP_FLEXIO2_FXIO_D06                                                      0x421C0118U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_AUDIO_SAI2_RX_SYNC                                                        0x421C0118U, 0x3U, 0X421C8038U, 0x0U
#define IOMUXC_PIO4_6_MEDIA_CSI_DATA17                                                          0x421C0118U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_HSP_SINC1_MCLK3                                                           0x421C0118U, 0x5U, 0X421C82C0U, 0x0U
#define IOMUXC_PIO4_6_MEDIA_DCIF_DATA06                                                         0x421C0118U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_MEDIA_DCIF_DBI_AB_DATA06                                                  0x421C0118U, 0x7U, 0X421C8454U, 0x1U
#define IOMUXC_PIO4_6_HSP_eFlexPWM2_PWM_A3                                                      0x421C0118U, 0x8U, 0X421C8154U, 0x1U
#define IOMUXC_PIO4_6_HSP_LPUART4_RTS_B                                                         0x421C0118U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_6_HSP_XBAR0_INOUT06                                                         0x421C0118U, 0xAU, 0X421C82DCU, 0x2U
#define IOMUXC_PIO4_6_HSP_XBAR1_INOUT06                                                         0x421C0118U, 0xBU, 0X421C834CU, 0x2U

