zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO4_7_HSP_GPIO2_GPIO7                                                           0x421C011CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_COMM_ENET_MDC                                                             0x421C011CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_HSP_FLEXIO2_FXIO_D07                                                      0x421C011CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_AUDIO_SAI2_TX_DATA1                                                       0x421C011CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_MEDIA_CSI_DATA16                                                          0x421C011CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_HSP_SINC1_MBIT3                                                           0x421C011CU, 0x5U, 0X421C82B0U, 0x0U
#define IOMUXC_PIO4_7_MEDIA_DCIF_DATA07                                                         0x421C011CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_7_MEDIA_DCIF_DBI_AB_DATA07                                                  0x421C011CU, 0x7U, 0X421C8458U, 0x1U
#define IOMUXC_PIO4_7_HSP_eFlexPWM2_PWM_B3                                                      0x421C011CU, 0x8U, 0X421C8164U, 0x1U
#define IOMUXC_PIO4_7_HSP_LPUART4_CTS_B                                                         0x421C011CU, 0x9U, 0X421C826CU, 0x1U
#define IOMUXC_PIO4_7_HSP_XBAR0_INOUT07                                                         0x421C011CU, 0xAU, 0X421C82E0U, 0x2U
#define IOMUXC_PIO4_7_HSP_XBAR1_INOUT07                                                         0x421C011CU, 0xBU, 0X421C8350U, 0x2U

#define IOMUXC_PIO4_8_HSP_GPIO2_GPIO8                                                           0x421C0120U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_COMM_ENET_TXD2                                                            0x421C0120U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_HSP_FLEXIO2_FXIO_D08                                                      0x421C0120U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_AUDIO_SAI2_RX_DATA1                                                       0x421C0120U, 0x3U, 0X421C8034U, 0x0U
#define IOMUXC_PIO4_8_MEDIA_CSI_DATA15                                                          0x421C0120U, 0x4U, 0X421C842CU, 0x1U
#define IOMUXC_PIO4_8_HSP_SINC1_BREAK                                                           0x421C0120U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_MEDIA_DCIF_DATA08                                                         0x421C0120U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_MEDIA_DCIF_DBI_AB_CSX                                                     0x421C0120U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_COMM_TENBASET_PHY1_TX                                                     0x421C0120U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_8_HSP_LPUART4_TXD                                                           0x421C0120U, 0x9U, 0X421C8274U, 0x1U
#define IOMUXC_PIO4_8_HSP_XBAR0_INOUT08                                                         0x421C0120U, 0xAU, 0X421C82E4U, 0x2U
#define IOMUXC_PIO4_8_HSP_XBAR1_INOUT08                                                         0x421C0120U, 0xBU, 0X421C8354U, 0x2U

#define IOMUXC_PIO4_9_HSP_GPIO2_GPIO9                                                           0x421C0124U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_COMM_ENET_TXD3                                                            0x421C0124U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_HSP_FLEXIO2_FXIO_D09                                                      0x421C0124U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_MEDIA_CSI_DATA14                                                          0x421C0124U, 0x4U, 0X421C8428U, 0x1U
#define IOMUXC_PIO4_9_MEDIA_DCIF_DATA09                                                         0x421C0124U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_MEDIA_DCIF_DBI_AB_DCS                                                     0x421C0124U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_9_HSP_eFlexPWM3_PWM_A0                                                      0x421C0124U, 0x8U, 0X421C8178U, 0x0U
#define IOMUXC_PIO4_9_HSP_LPUART4_RXD                                                           0x421C0124U, 0x9U, 0X421C8270U, 0x1U
#define IOMUXC_PIO4_9_HSP_XBAR0_INOUT09                                                         0x421C0124U, 0xAU, 0X421C82E8U, 0x2U
#define IOMUXC_PIO4_9_HSP_XBAR1_INOUT09                                                         0x421C0124U, 0xBU, 0X421C8358U, 0x2U

#define IOMUXC_PIO4_10_HSP_GPIO2_GPIO10                                                         0x421C0128U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_COMM_ENET_RX_CLK                                                         0x421C0128U, 0x1U, 0X421C8088U, 0x0U
#define IOMUXC_PIO4_10_HSP_FLEXIO2_FXIO_D10                                                     0x421C0128U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_AUDIO_MICFIL_PDM_CLK                                                     0x421C0128U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_MEDIA_CSI_DATA13                                                         0x421C0128U, 0x4U, 0X421C8424U, 0x1U
#define IOMUXC_PIO4_10_MEDIA_DCIF_DBI_A_E                                                       0x421C0128U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_MEDIA_DCIF_DATA10                                                        0x421C0128U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_MEDIA_DCIF_DBI_B_RDX                                                     0x421C0128U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_10_HSP_eFlexPWM3_PWM_B0                                                     0x421C0128U, 0x8U, 0X421C8188U, 0x0U
#define IOMUXC_PIO4_10_HSP_LPUART5_TXD                                                          0x421C0128U, 0x9U, 0X421C8280U, 0x1U
#define IOMUXC_PIO4_10_COMM_ENET_QOS_COL                                                        0x421C0128U, 0xAU, 0X421C8058U, 0x1U
#define IOMUXC_PIO4_10_HSP_XBAR1_INOUT10                                                        0x421C0128U, 0xBU, 0X421C835CU, 0x2U

