zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO4_11_HSP_GPIO2_GPIO11                                                         0x421C012CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_COMM_ENET_RXD2                                                           0x421C012CU, 0x1U, 0X421C8094U, 0x0U
#define IOMUXC_PIO4_11_HSP_FLEXIO2_FXIO_D11                                                     0x421C012CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_AUDIO_MICFIL_PDM_DATA45                                                  0x421C012CU, 0x3U, 0X421C8008U, 0x3U
#define IOMUXC_PIO4_11_MEDIA_CSI_DATA12                                                         0x421C012CU, 0x4U, 0X421C8420U, 0x1U
#define IOMUXC_PIO4_11_MEDIA_DCIF_DBI_A_RWX_OR_B_WRX                                              0x421C012CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_MEDIA_DCIF_DATA11                                                        0x421C012CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_COMM_TENBASET_PHY1_TX                                                    0x421C012CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_11_HSP_eFlexPWM3_PWM_A1                                                     0x421C012CU, 0x8U, 0X421C817CU, 0x0U
#define IOMUXC_PIO4_11_HSP_LPUART5_RXD                                                          0x421C012CU, 0x9U, 0X421C827CU, 0x1U
#define IOMUXC_PIO4_11_COMM_ENET_QOS_CRS                                                        0x421C012CU, 0xAU, 0X421C805CU, 0x1U
#define IOMUXC_PIO4_11_HSP_XBAR1_INOUT11                                                        0x421C012CU, 0xBU, 0X421C8360U, 0x2U

#define IOMUXC_PIO4_12_HSP_GPIO2_GPIO12                                                         0x421C0130U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_COMM_ENET_RXD3                                                           0x421C0130U, 0x1U, 0X421C8098U, 0x0U
#define IOMUXC_PIO4_12_HSP_FLEXIO2_FXIO_D12                                                     0x421C0130U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_AUDIO_MICFIL_PDM_DATA23                                                  0x421C0130U, 0x3U, 0X421C8004U, 0x3U
#define IOMUXC_PIO4_12_MEDIA_CSI_DATA11                                                         0x421C0130U, 0x4U, 0X421C841CU, 0x1U
#define IOMUXC_PIO4_12_HSP_LPSPI2_PCS2                                                          0x421C0130U, 0x5U, 0X421C81F0U, 0x0U
#define IOMUXC_PIO4_12_MEDIA_DCIF_DATA12                                                        0x421C0130U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_COMM_TENBASET_PHY1_ED                                                    0x421C0130U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_HSP_eFlexPWM3_PWM_B1                                                     0x421C0130U, 0x8U, 0X421C818CU, 0x0U
#define IOMUXC_PIO4_12_HSP_LPUART5_CTS_B                                                        0x421C0130U, 0x9U, 0X421C8278U, 0x1U
#define IOMUXC_PIO4_12_COMM_ENET_QOS_TX_ER                                                      0x421C0130U, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO4_12_HSP_XBAR1_INOUT12                                                        0x421C0130U, 0xBU, 0X421C8364U, 0x2U

#define IOMUXC_PIO4_13_HSP_GPIO2_GPIO13                                                         0x421C0134U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_COMM_ENET_RX_EN                                                          0x421C0134U, 0x1U, 0X421C809CU, 0x0U
#define IOMUXC_PIO4_13_HSP_FLEXIO2_FXIO_D13                                                     0x421C0134U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_AUDIO_MICFIL_PDM_DATA01                                                  0x421C0134U, 0x3U, 0X421C8000U, 0x3U
#define IOMUXC_PIO4_13_MEDIA_CSI_DATA10                                                         0x421C0134U, 0x4U, 0X421C8418U, 0x1U
#define IOMUXC_PIO4_13_HSP_LPSPI2_PCS3                                                          0x421C0134U, 0x5U, 0X421C81F4U, 0x0U
#define IOMUXC_PIO4_13_MEDIA_DCIF_DATA13                                                        0x421C0134U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_COMM_TENBASET_PHY1_RX                                                    0x421C0134U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_HSP_eFlexPWM3_PWM_A2                                                     0x421C0134U, 0x8U, 0X421C8180U, 0x0U
#define IOMUXC_PIO4_13_HSP_LPUART5_RTS_B                                                        0x421C0134U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_13_COMM_ENET_QOS_RX_ER                                                      0x421C0134U, 0xAU, 0X421C8074U, 0x1U
#define IOMUXC_PIO4_13_HSP_XBAR1_INOUT13                                                        0x421C0134U, 0xBU, 0X421C8368U, 0x2U

#define IOMUXC_PIO4_14_HSP_GPIO2_GPIO14                                                         0x421C0138U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_14_COMM_ENET_QOS_TX_CLK_IO                                                  0x421C0138U, 0x1U, 0X421C8050U, 0x1U
#define IOMUXC_PIO4_14_HSP_FLEXIO2_FXIO_D14                                                     0x421C0138U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_14_COMM_ENET_QOS_REF_CLK1                                                   0x421C0138U, 0x3U, 0X421C8048U, 0x1U
#define IOMUXC_PIO4_14_MEDIA_CSI_DATA09                                                         0x421C0138U, 0x4U, 0X421C8414U, 0x1U
#define IOMUXC_PIO4_14_HSP_LPSPI2_PCS0                                                          0x421C0138U, 0x5U, 0X421C81E8U, 0x0U
#define IOMUXC_PIO4_14_MEDIA_DCIF_DATA14                                                        0x421C0138U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_14_HSP_eFlexPWM3_PWM_B2                                                     0x421C0138U, 0x8U, 0X421C8190U, 0x0U
#define IOMUXC_PIO4_14_COMM_ENET_RX_ER                                                          0x421C0138U, 0xAU, 0X421C80A0U, 0x1U
#define IOMUXC_PIO4_14_HSP_XBAR1_INOUT14                                                        0x421C0138U, 0xBU, 0X421C836CU, 0x2U

#define IOMUXC_PIO4_15_HSP_GPIO2_GPIO15                                                         0x421C013CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_COMM_ENET_QOS_TX_DATA0                                                   0x421C013CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_HSP_FLEXIO2_FXIO_D15                                                     0x421C013CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_MEDIA_CSI_DATA08                                                         0x421C013CU, 0x4U, 0X421C8410U, 0x1U
#define IOMUXC_PIO4_15_HSP_LPSPI2_SCK                                                           0x421C013CU, 0x5U, 0X421C81F8U, 0x0U
#define IOMUXC_PIO4_15_MEDIA_DCIF_DATA15                                                        0x421C013CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_HSP_eFlexPWM3_PWM_A3                                                     0x421C013CU, 0x8U, 0X421C8184U, 0x0U
#define IOMUXC_PIO4_15_COMM_ENET_TX_ER                                                          0x421C013CU, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO4_15_HSP_XBAR1_INOUT15                                                        0x421C013CU, 0xBU, 0X421C8370U, 0x2U

