zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO4_16_HSP_GPIO2_GPIO16                                                         0x421C0140U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_COMM_ENET_QOS_TX_DATA1                                                   0x421C0140U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_HSP_FLEXIO2_FXIO_D16                                                     0x421C0140U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_MEDIA_CSI_DATA07                                                         0x421C0140U, 0x4U, 0X421C840CU, 0x1U
#define IOMUXC_PIO4_16_HSP_LPSPI2_SOUT                                                          0x421C0140U, 0x5U, 0X421C8200U, 0x0U
#define IOMUXC_PIO4_16_MEDIA_DCIF_DATA16                                                        0x421C0140U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_16_HSP_eFlexPWM3_PWM_B3                                                     0x421C0140U, 0x8U, 0X421C8194U, 0x0U
#define IOMUXC_PIO4_16_COMM_ENET_CRS                                                            0x421C0140U, 0xAU, 0X421C8080U, 0x1U
#define IOMUXC_PIO4_16_HSP_XBAR1_INOUT16                                                        0x421C0140U, 0xBU, 0X421C8374U, 0x2U

#define IOMUXC_PIO4_17_HSP_GPIO2_GPIO17                                                         0x421C0144U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_COMM_ENET_QOS_TX_EN                                                      0x421C0144U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_HSP_FLEXIO2_FXIO_D17                                                     0x421C0144U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_AUDIO_SAI2_RX_DATA1                                                      0x421C0144U, 0x3U, 0X421C8034U, 0x1U
#define IOMUXC_PIO4_17_MEDIA_CSI_DATA06                                                         0x421C0144U, 0x4U, 0X421C8408U, 0x1U
#define IOMUXC_PIO4_17_HSP_LPSPI2_SIN                                                           0x421C0144U, 0x5U, 0X421C81FCU, 0x0U
#define IOMUXC_PIO4_17_MEDIA_DCIF_DATA17                                                        0x421C0144U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_HSP_eFlexPWM3_PWM_X0                                                     0x421C0144U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_HSP_FlexCAN2_CAN_TX                                                      0x421C0144U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_17_COMM_ENET_COL                                                            0x421C0144U, 0xAU, 0X421C807CU, 0x1U
#define IOMUXC_PIO4_17_HSP_XBAR1_INOUT17                                                        0x421C0144U, 0xBU, 0X421C8378U, 0x2U

#define IOMUXC_PIO4_18_HSP_GPIO2_GPIO18                                                         0x421C0148U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_COMM_ENET_QOS_RX_DATA0                                                   0x421C0148U, 0x1U, 0X421C8060U, 0x1U
#define IOMUXC_PIO4_18_HSP_FLEXIO2_FXIO_D18                                                     0x421C0148U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_AUDIO_SAI2_TX_DATA1                                                      0x421C0148U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_MEDIA_CSI_DATA05                                                         0x421C0148U, 0x4U, 0X421C8404U, 0x1U
#define IOMUXC_PIO4_18_HSP_LPSPI2_PCS1                                                          0x421C0148U, 0x5U, 0X421C81ECU, 0x0U
#define IOMUXC_PIO4_18_MEDIA_DCIF_DATA18                                                        0x421C0148U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_HSP_eFlexPWM3_PWM_X1                                                     0x421C0148U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_HSP_FlexCAN2_CAN_RX                                                      0x421C0148U, 0x9U, 0X421C8108U, 0x1U
#define IOMUXC_PIO4_18_WAKE_EWM_OUT_B                                                           0x421C0148U, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO4_18_HSP_XBAR1_INOUT18                                                        0x421C0148U, 0xBU, 0X421C837CU, 0x2U

#define IOMUXC_PIO4_19_HSP_GPIO2_GPIO19                                                         0x421C014CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_COMM_ENET_QOS_RX_DATA1                                                   0x421C014CU, 0x1U, 0X421C8064U, 0x1U
#define IOMUXC_PIO4_19_HSP_FLEXIO2_FXIO_D19                                                     0x421C014CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_AUDIO_SAI2_MCLK                                                          0x421C014CU, 0x3U, 0X421C8028U, 0x1U
#define IOMUXC_PIO4_19_MEDIA_CSI_DATA04                                                         0x421C014CU, 0x4U, 0X421C8400U, 0x1U
#define IOMUXC_PIO4_19_MEDIA_DCIF_DATA19                                                        0x421C014CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_HSP_eFlexPWM3_PWM_X2                                                     0x421C014CU, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_19_HSP_SINC1_MBIT0                                                          0x421C014CU, 0xAU, 0X421C82A4U, 0x1U
#define IOMUXC_PIO4_19_HSP_XBAR1_INOUT19                                                        0x421C014CU, 0xBU, 0X421C8380U, 0x2U

#define IOMUXC_PIO4_20_HSP_GPIO2_GPIO20                                                         0x421C0150U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_COMM_ENET_QOS_MDIO                                                       0x421C0150U, 0x1U, 0X421C8054U, 0x1U
#define IOMUXC_PIO4_20_HSP_FLEXIO2_FXIO_D20                                                     0x421C0150U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_AUDIO_SAI2_RX_DATA0                                                      0x421C0150U, 0x3U, 0X421C8030U, 0x1U
#define IOMUXC_PIO4_20_MEDIA_CSI_DATA03                                                         0x421C0150U, 0x4U, 0X421C83FCU, 0x1U
#define IOMUXC_PIO4_20_MEDIA_DCIF_DATA20                                                        0x421C0150U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_HSP_eFlexPWM3_PWM_X3                                                     0x421C0150U, 0x8U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_HSP_LPUART4_RTS_B                                                        0x421C0150U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_20_HSP_SINC1_MBIT1                                                          0x421C0150U, 0xAU, 0X421C82A8U, 0x1U
#define IOMUXC_PIO4_20_HSP_XBAR1_INOUT20                                                        0x421C0150U, 0xBU, 0X421C8384U, 0x2U

#define IOMUXC_PIO4_21_HSP_GPIO2_GPIO21                                                         0x421C0154U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_COMM_ENET_QOS_MDC                                                        0x421C0154U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_HSP_FLEXIO2_FXIO_D21                                                     0x421C0154U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_AUDIO_SAI2_TX_DATA0                                                      0x421C0154U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_MEDIA_CSI_DATA02                                                         0x421C0154U, 0x4U, 0X421C83F8U, 0x1U
#define IOMUXC_PIO4_21_AUDIO_SPDIF_IN                                                           0x421C0154U, 0x5U, 0X421C8044U, 0x1U
#define IOMUXC_PIO4_21_MEDIA_DCIF_DATA21                                                        0x421C0154U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_21_HSP_eFlexPWM2_PWM_X0                                                     0x421C0154U, 0x8U, 0X421C8168U, 0x1U
#define IOMUXC_PIO4_21_HSP_LPUART4_CTS_B                                                        0x421C0154U, 0x9U, 0X421C826CU, 0x2U
#define IOMUXC_PIO4_21_HSP_SINC1_MBIT2                                                          0x421C0154U, 0xAU, 0X421C82ACU, 0x1U
#define IOMUXC_PIO4_21_HSP_XBAR1_INOUT21                                                        0x421C0154U, 0xBU, 0X421C8388U, 0x2U

