zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO4_22_HSP_GPIO2_GPIO22                                                         0x421C0158U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_COMM_ENET_QOS_TX_DATA2                                                   0x421C0158U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_HSP_FLEXIO2_FXIO_D22                                                     0x421C0158U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_AUDIO_SAI2_TX_BCLK                                                       0x421C0158U, 0x3U, 0X421C803CU, 0x1U
#define IOMUXC_PIO4_22_MEDIA_CSI_DATA01                                                         0x421C0158U, 0x4U, 0X421C83F4U, 0x1U
#define IOMUXC_PIO4_22_AUDIO_SPDIF_OUT                                                          0x421C0158U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_MEDIA_DCIF_DATA22                                                        0x421C0158U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_22_HSP_eFlexPWM2_PWM_X1                                                     0x421C0158U, 0x8U, 0X421C816CU, 0x1U
#define IOMUXC_PIO4_22_HSP_LPUART4_RXD                                                          0x421C0158U, 0x9U, 0X421C8270U, 0x2U
#define IOMUXC_PIO4_22_HSP_SINC1_MBIT3                                                          0x421C0158U, 0xAU, 0X421C82B0U, 0x1U
#define IOMUXC_PIO4_22_HSP_XBAR1_INOUT22                                                        0x421C0158U, 0xBU, 0X421C838CU, 0x2U

#define IOMUXC_PIO4_23_HSP_GPIO2_GPIO23                                                         0x421C015CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_COMM_ENET_QOS_TX_DATA3                                                   0x421C015CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_HSP_FLEXIO2_FXIO_D23                                                     0x421C015CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_AUDIO_SAI2_TX_SYNC                                                       0x421C015CU, 0x3U, 0X421C8040U, 0x1U
#define IOMUXC_PIO4_23_MEDIA_CSI_DATA00                                                         0x421C015CU, 0x4U, 0X421C83F0U, 0x1U
#define IOMUXC_PIO4_23_HSP_SINC1_MCLK_OUT0                                                      0x421C015CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_MEDIA_DCIF_DATA23                                                        0x421C015CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_23_HSP_eFlexPWM2_PWM_X2                                                     0x421C015CU, 0x8U, 0X421C8170U, 0x1U
#define IOMUXC_PIO4_23_HSP_LPUART4_TXD                                                          0x421C015CU, 0x9U, 0X421C8274U, 0x2U
#define IOMUXC_PIO4_23_HSP_SINC1_MCLK0                                                          0x421C015CU, 0xAU, 0X421C82B4U, 0x1U
#define IOMUXC_PIO4_23_HSP_XBAR1_INOUT23                                                        0x421C015CU, 0xBU, 0X421C8390U, 0x2U

#define IOMUXC_PIO4_24_HSP_GPIO2_GPIO24                                                         0x421C0160U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_COMM_ENET_QOS_RX_CLK                                                     0x421C0160U, 0x1U, 0X421C804CU, 0x1U
#define IOMUXC_PIO4_24_HSP_FLEXIO2_FXIO_D24                                                     0x421C0160U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_AUDIO_SAI2_RX_SYNC                                                       0x421C0160U, 0x3U, 0X421C8038U, 0x1U
#define IOMUXC_PIO4_24_MEDIA_CSI_MCLK                                                           0x421C0160U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_HSP_SINC1_MCLK_OUT1                                                      0x421C0160U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_MEDIA_DCIF_PIXEL_CLK                                                     0x421C0160U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_24_HSP_eFlexPWM2_PWM_X3                                                     0x421C0160U, 0x8U, 0X421C8174U, 0x1U
#define IOMUXC_PIO4_24_HSP_LPUART5_CTS_B                                                        0x421C0160U, 0x9U, 0X421C8278U, 0x2U
#define IOMUXC_PIO4_24_HSP_SINC1_MCLK1                                                          0x421C0160U, 0xAU, 0X421C82B8U, 0x1U
#define IOMUXC_PIO4_24_HSP_XBAR1_INOUT24                                                        0x421C0160U, 0xBU, 0X421C8394U, 0x2U

#define IOMUXC_PIO4_25_HSP_GPIO2_GPIO25                                                         0x421C0164U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_COMM_ENET_QOS_RX_DATA2                                                   0x421C0164U, 0x1U, 0X421C8068U, 0x1U
#define IOMUXC_PIO4_25_HSP_FLEXIO2_FXIO_D25                                                     0x421C0164U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_AUDIO_SAI2_RX_BCLK                                                       0x421C0164U, 0x3U, 0X421C802CU, 0x1U
#define IOMUXC_PIO4_25_MEDIA_CSI_HSYNC                                                          0x421C0164U, 0x4U, 0X421C8430U, 0x1U
#define IOMUXC_PIO4_25_HSP_SINC1_MCLK_OUT2                                                      0x421C0164U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_MEDIA_DCIF_HSYNC                                                         0x421C0164U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_COMM_TENBASET_PHY0_TX                                                    0x421C0164U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_HSP_LPUART5_RTS_B                                                        0x421C0164U, 0x9U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_25_HSP_SINC1_MCLK2                                                          0x421C0164U, 0xAU, 0X421C82BCU, 0x1U
#define IOMUXC_PIO4_25_HSP_XBAR1_INOUT25                                                        0x421C0164U, 0xBU, 0X421C8398U, 0x2U

#define IOMUXC_PIO4_26_HSP_GPIO2_GPIO26                                                         0x421C0168U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_COMM_ENET_QOS_RX_DATA3                                                   0x421C0168U, 0x1U, 0X421C806CU, 0x1U
#define IOMUXC_PIO4_26_HSP_FLEXIO2_FXIO_D26                                                     0x421C0168U, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_MAIN_XSPI0_ECS                                                           0x421C0168U, 0x3U, 0X421C83ECU, 0x2U
#define IOMUXC_PIO4_26_MEDIA_CSI_VSYNC                                                          0x421C0168U, 0x4U, 0X421C8438U, 0x1U
#define IOMUXC_PIO4_26_AUDIO_MQS_MQS_LEFT                                                       0x421C0168U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_MEDIA_DCIF_VSYNC                                                         0x421C0168U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_26_COMM_TENBASET_PHY0_ED                                                    0x421C0168U, 0x7U, 0X421C80D0U, 0x1U
#define IOMUXC_PIO4_26_HSP_LPUART5_TXD                                                          0x421C0168U, 0x9U, 0X421C8280U, 0x2U
#define IOMUXC_PIO4_26_HSP_SINC1_MCLK3                                                          0x421C0168U, 0xAU, 0X421C82C0U, 0x1U
#define IOMUXC_PIO4_26_HSP_XBAR1_INOUT26                                                        0x421C0168U, 0xBU, 0X421C839CU, 0x2U

#define IOMUXC_PIO4_27_HSP_GPIO2_GPIO27                                                         0x421C016CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_COMM_ENET_QOS_RX_EN                                                      0x421C016CU, 0x1U, 0X421C8070U, 0x1U
#define IOMUXC_PIO4_27_HSP_FLEXIO2_FXIO_D27                                                     0x421C016CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_MAIN_TRACE_SWO                                                           0x421C016CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_MEDIA_CSI_PIXCLK                                                         0x421C016CU, 0x4U, 0X421C8434U, 0x1U
#define IOMUXC_PIO4_27_AUDIO_MQS_MQS_RIGHT                                                      0x421C016CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_MEDIA_DCIF_DE                                                            0x421C016CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_COMM_TENBASET_PHY0_RX                                                    0x421C016CU, 0x7U, 0X421C80D4U, 0x1U
#define IOMUXC_PIO4_27_HSP_LPUART5_RXD                                                          0x421C016CU, 0x9U, 0X421C827CU, 0x2U
#define IOMUXC_PIO4_27_HSP_SINC1_BREAK                                                          0x421C016CU, 0xAU, 0x00000000U, 0x0U
#define IOMUXC_PIO4_27_HSP_XBAR1_INOUT27                                                        0x421C016CU, 0xBU, 0X421C83A0U, 0x2U

#define IOMUXC_PIO5_0_HSP_GPIO3_GPIO0                                                           0x421C0180U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_0_MAIN_XSPI1_SS0_N                                                          0x421C0180U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_0_COMM_ENET_REF_CLK                                                         0x421C0180U, 0x4U, 0X421C8078U, 0x1U
#define IOMUXC_PIO5_0_MAIN_AHB_SRAMC_SRAMC_CS0                                                  0x421C0180U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_0_HSP_eFlexPWM3_PWM_A0                                                      0x421C0180U, 0x6U, 0X421C8178U, 0x1U
#define IOMUXC_PIO5_0_HSP_LPSPI2_PCS0                                                           0x421C0180U, 0x8U, 0X421C81E8U, 0x1U

#define IOMUXC_PIO5_1_HSP_GPIO3_GPIO1                                                           0x421C0184U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_1_MAIN_XSPI1_DATA0                                                          0x421C0184U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_1_COMM_ENET_TXD0                                                            0x421C0184U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_1_MAIN_AHB_SRAMC_SRAMC_DA00                                                 0x421C0184U, 0x5U, 0X421C83A4U, 0x1U
#define IOMUXC_PIO5_1_HSP_eFlexPWM3_PWM_B0                                                      0x421C0184U, 0x6U, 0X421C8188U, 0x1U
#define IOMUXC_PIO5_1_HSP_LPSPI2_SOUT                                                           0x421C0184U, 0x8U, 0X421C8200U, 0x1U

