zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO5_2_HSP_GPIO3_GPIO2                                                           0x421C0188U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_2_MAIN_XSPI1_DATA1                                                          0x421C0188U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_2_COMM_ENET_TXD1                                                            0x421C0188U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_2_MAIN_AHB_SRAMC_SRAMC_DA01                                                 0x421C0188U, 0x5U, 0X421C83A8U, 0x1U
#define IOMUXC_PIO5_2_HSP_eFlexPWM3_PWM_A1                                                      0x421C0188U, 0x6U, 0X421C817CU, 0x1U
#define IOMUXC_PIO5_2_HSP_LPSPI2_SIN                                                            0x421C0188U, 0x8U, 0X421C81FCU, 0x1U

#define IOMUXC_PIO5_3_HSP_GPIO3_GPIO3                                                           0x421C018CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_3_MAIN_XSPI1_DATA2                                                          0x421C018CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_3_COMM_ENET_TX_EN                                                           0x421C018CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_3_MAIN_AHB_SRAMC_SRAMC_DA02                                                 0x421C018CU, 0x5U, 0X421C83ACU, 0x1U
#define IOMUXC_PIO5_3_HSP_eFlexPWM3_PWM_B1                                                      0x421C018CU, 0x6U, 0X421C818CU, 0x1U
#define IOMUXC_PIO5_3_HSP_LPSPI2_PCS2                                                           0x421C018CU, 0x8U, 0X421C81F0U, 0x1U

#define IOMUXC_PIO5_4_HSP_GPIO3_GPIO4                                                           0x421C0190U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_4_MAIN_XSPI1_DATA3                                                          0x421C0190U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_4_COMM_ENET_RXD0                                                            0x421C0190U, 0x4U, 0X421C808CU, 0x1U
#define IOMUXC_PIO5_4_MAIN_AHB_SRAMC_SRAMC_DA03                                                 0x421C0190U, 0x5U, 0X421C83B0U, 0x1U
#define IOMUXC_PIO5_4_HSP_eFlexPWM3_PWM_A2                                                      0x421C0190U, 0x6U, 0X421C8180U, 0x1U
#define IOMUXC_PIO5_4_HSP_LPSPI2_PCS3                                                           0x421C0190U, 0x8U, 0X421C81F4U, 0x1U

#define IOMUXC_PIO5_5_HSP_GPIO3_GPIO5                                                           0x421C0194U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_5_MAIN_XSPI1_SCLK0                                                          0x421C0194U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_5_COMM_ENET_RXD1                                                            0x421C0194U, 0x4U, 0X421C8090U, 0x1U
#define IOMUXC_PIO5_5_MAIN_AHB_SRAMC_SRAMC_DA04                                                 0x421C0194U, 0x5U, 0X421C83B4U, 0x1U
#define IOMUXC_PIO5_5_HSP_eFlexPWM3_PWM_B2                                                      0x421C0194U, 0x6U, 0X421C8190U, 0x1U
#define IOMUXC_PIO5_5_HSP_LPSPI2_SCK                                                            0x421C0194U, 0x8U, 0X421C81F8U, 0x1U

#define IOMUXC_PIO5_6_HSP_GPIO3_GPIO6                                                           0x421C0198U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_6_MAIN_XSPI1_DATA4                                                          0x421C0198U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_6_COMM_ENET_CRS                                                             0x421C0198U, 0x4U, 0X421C8080U, 0x2U
#define IOMUXC_PIO5_6_MAIN_AHB_SRAMC_SRAMC_DA05                                                 0x421C0198U, 0x5U, 0X421C83B8U, 0x1U
#define IOMUXC_PIO5_6_HSP_eFlexPWM3_PWM_A3                                                      0x421C0198U, 0x6U, 0X421C8184U, 0x1U
#define IOMUXC_PIO5_6_HSP_LPSPI2_PCS1                                                           0x421C0198U, 0x8U, 0X421C81ECU, 0x1U

#define IOMUXC_PIO5_7_HSP_GPIO3_GPIO7                                                           0x421C019CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_7_MAIN_XSPI1_DATA5                                                          0x421C019CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_7_COMM_ENET_RX_ER                                                           0x421C019CU, 0x4U, 0X421C80A0U, 0x2U
#define IOMUXC_PIO5_7_MAIN_AHB_SRAMC_SRAMC_DA06                                                 0x421C019CU, 0x5U, 0X421C83BCU, 0x1U
#define IOMUXC_PIO5_7_HSP_eFlexPWM3_PWM_B3                                                      0x421C019CU, 0x6U, 0X421C8194U, 0x1U
#define IOMUXC_PIO5_7_HSP_LPSPI3_SIN                                                            0x421C019CU, 0x8U, 0X421C8218U, 0x0U

#define IOMUXC_PIO5_8_HSP_GPIO3_GPIO8                                                           0x421C01A0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_8_MAIN_XSPI1_DATA6                                                          0x421C01A0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_8_COMM_ENET_MDIO                                                            0x421C01A0U, 0x4U, 0X421C8084U, 0x1U
#define IOMUXC_PIO5_8_MAIN_AHB_SRAMC_SRAMC_DA07                                                 0x421C01A0U, 0x5U, 0X421C83C0U, 0x1U
#define IOMUXC_PIO5_8_HSP_LPSPI3_SOUT                                                           0x421C01A0U, 0x8U, 0X421C821CU, 0x0U

#define IOMUXC_PIO5_9_HSP_GPIO3_GPIO9                                                           0x421C01A4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_9_MAIN_XSPI1_DATA7                                                          0x421C01A4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_9_COMM_ENET_MDC                                                             0x421C01A4U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_9_MAIN_AHB_SRAMC_SRAMC_DA08                                                 0x421C01A4U, 0x5U, 0X421C83C4U, 0x1U
#define IOMUXC_PIO5_9_HSP_LPSPI3_SCK                                                            0x421C01A4U, 0x8U, 0X421C8214U, 0x0U

#define IOMUXC_PIO5_10_HSP_GPIO3_GPIO10                                                         0x421C01A8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_10_MAIN_XSPI1_DQS0                                                          0x421C01A8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_10_COMM_FlexSPI_FLR_XSPI_FLR_CS                                              0x421C01A8U, 0x3U, 0X421C80D8U, 0x0U
#define IOMUXC_PIO5_10_MAIN_AHB_SRAMC_SRAMC_DA09                                                0x421C01A8U, 0x5U, 0X421C83C8U, 0x1U
#define IOMUXC_PIO5_10_HSP_LPSPI3_PCS0                                                          0x421C01A8U, 0x8U, 0X421C8204U, 0x0U

