zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO5_11_HSP_GPIO3_GPIO11                                                         0x421C01ACU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_MAIN_XSPI1_SCLK0_N                                                       0x421C01ACU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_MAIN_XSPI1_SS1_N                                                         0x421C01ACU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_COMM_FlexSPI_FLR_XSPI_FLR_CLK                                              0x421C01ACU, 0x3U, 0X421C8100U, 0x0U
#define IOMUXC_PIO5_11_COMM_ENET_TXD2                                                           0x421C01ACU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_11_MAIN_AHB_SRAMC_SRAMC_DA10                                                0x421C01ACU, 0x5U, 0X421C83CCU, 0x1U
#define IOMUXC_PIO5_11_HSP_LPSPI3_PCS1                                                          0x421C01ACU, 0x8U, 0X421C8208U, 0x0U

#define IOMUXC_PIO5_12_HSP_GPIO3_GPIO12                                                         0x421C01B0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_MAIN_XSPI1_DATA8                                                         0x421C01B0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_COMM_FlexSPI_FLR_XSPI_FLR_DATA0                                              0x421C01B0U, 0x3U, 0X421C80E0U, 0x0U
#define IOMUXC_PIO5_12_COMM_ENET_TXD3                                                           0x421C01B0U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_MAIN_AHB_SRAMC_SRAMC_DA11                                                0x421C01B0U, 0x5U, 0X421C83D0U, 0x1U
#define IOMUXC_PIO5_12_HSP_SINC0_MCLK_OUT0                                                      0x421C01B0U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_12_HSP_SINC0_MCLK0                                                          0x421C01B0U, 0x7U, 0X421C8294U, 0x1U
#define IOMUXC_PIO5_12_HSP_LPSPI3_PCS2                                                          0x421C01B0U, 0x8U, 0X421C820CU, 0x0U
#define IOMUXC_PIO5_12_HSP_FLEXIO0_FXIO_D28                                                     0x421C01B0U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_13_HSP_GPIO3_GPIO13                                                         0x421C01B4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_13_MAIN_XSPI1_DATA9                                                         0x421C01B4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_13_COMM_FlexSPI_FLR_XSPI_FLR_DATA1                                              0x421C01B4U, 0x3U, 0X421C80E4U, 0x0U
#define IOMUXC_PIO5_13_MAIN_AHB_SRAMC_SRAMC_DA12                                                0x421C01B4U, 0x5U, 0X421C83D4U, 0x1U
#define IOMUXC_PIO5_13_HSP_SINC0_MCLK_OUT1                                                      0x421C01B4U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_13_HSP_SINC0_MCLK1                                                          0x421C01B4U, 0x7U, 0X421C8298U, 0x1U
#define IOMUXC_PIO5_13_HSP_LPSPI3_PCS3                                                          0x421C01B4U, 0x8U, 0X421C8210U, 0x0U
#define IOMUXC_PIO5_13_HSP_FLEXIO0_FXIO_D29                                                     0x421C01B4U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_14_HSP_GPIO3_GPIO14                                                         0x421C01B8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_14_MAIN_XSPI1_DATA10                                                        0x421C01B8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_14_COMM_FlexSPI_FLR_XSPI_FLR_DATA2                                              0x421C01B8U, 0x3U, 0X421C80E8U, 0x0U
#define IOMUXC_PIO5_14_COMM_ENET_RX_CLK                                                         0x421C01B8U, 0x4U, 0X421C8088U, 0x1U
#define IOMUXC_PIO5_14_MAIN_AHB_SRAMC_SRAMC_DA13                                                0x421C01B8U, 0x5U, 0X421C83D8U, 0x1U
#define IOMUXC_PIO5_14_HSP_SINC0_MCLK_OUT2                                                      0x421C01B8U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_14_HSP_SINC0_MCLK2                                                          0x421C01B8U, 0x7U, 0X421C829CU, 0x1U
#define IOMUXC_PIO5_14_HSP_LPSPI4_SIN                                                           0x421C01B8U, 0x8U, 0X421C8234U, 0x0U
#define IOMUXC_PIO5_14_HSP_FLEXIO0_FXIO_D30                                                     0x421C01B8U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_15_HSP_GPIO3_GPIO15                                                         0x421C01BCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_15_MAIN_XSPI1_DATA11                                                        0x421C01BCU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_15_COMM_uSDHC1_CLK                                                          0x421C01BCU, 0x2U, 0X421C80B8U, 0x0U
#define IOMUXC_PIO5_15_COMM_FlexSPI_FLR_XSPI_FLR_DATA3                                              0x421C01BCU, 0x3U, 0X421C80ECU, 0x0U
#define IOMUXC_PIO5_15_COMM_ENET_RXD2                                                           0x421C01BCU, 0x4U, 0X421C8094U, 0x1U
#define IOMUXC_PIO5_15_MAIN_AHB_SRAMC_SRAMC_DA14                                                0x421C01BCU, 0x5U, 0X421C83DCU, 0x1U
#define IOMUXC_PIO5_15_HSP_SINC0_MCLK3                                                          0x421C01BCU, 0x7U, 0X421C82A0U, 0x1U
#define IOMUXC_PIO5_15_HSP_LPSPI4_SOUT                                                          0x421C01BCU, 0x8U, 0X421C8238U, 0x0U
#define IOMUXC_PIO5_15_HSP_FLEXIO0_FXIO_D31                                                     0x421C01BCU, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_16_HSP_GPIO3_GPIO16                                                         0x421C01C0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_16_MAIN_XSPI1_DQS1                                                          0x421C01C0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_16_COMM_uSDHC1_CMD                                                          0x421C01C0U, 0x2U, 0X421C80BCU, 0x0U
#define IOMUXC_PIO5_16_COMM_FlexSPI_FLR_XSPI_FLR_DQS                                              0x421C01C0U, 0x3U, 0X421C80DCU, 0x0U
#define IOMUXC_PIO5_16_COMM_ENET_RXD3                                                           0x421C01C0U, 0x4U, 0X421C8098U, 0x1U
#define IOMUXC_PIO5_16_MAIN_AHB_SRAMC_SRAMC_DA15                                                0x421C01C0U, 0x5U, 0X421C83E0U, 0x1U
#define IOMUXC_PIO5_16_HSP_SINC0_MBIT0                                                          0x421C01C0U, 0x7U, 0X421C8284U, 0x1U
#define IOMUXC_PIO5_16_HSP_LPSPI4_SCK                                                           0x421C01C0U, 0x8U, 0X421C8230U, 0x0U

#define IOMUXC_PIO5_17_HSP_GPIO3_GPIO17                                                         0x421C01C4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_17_MAIN_XSPI1_DATA12                                                        0x421C01C4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_17_COMM_uSDHC1_DAT0                                                         0x421C01C4U, 0x2U, 0X421C80C0U, 0x0U
#define IOMUXC_PIO5_17_COMM_FlexSPI_FLR_XSPI_FLR_DATA4                                              0x421C01C4U, 0x3U, 0X421C80F0U, 0x0U
#define IOMUXC_PIO5_17_COMM_ENET_RX_EN                                                          0x421C01C4U, 0x4U, 0X421C809CU, 0x1U
#define IOMUXC_PIO5_17_MAIN_AHB_SRAMC_SRAMC_WEB                                                 0x421C01C4U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_17_HSP_SINC0_MBIT1                                                          0x421C01C4U, 0x7U, 0X421C8288U, 0x1U
#define IOMUXC_PIO5_17_HSP_LPSPI4_PCS0                                                          0x421C01C4U, 0x8U, 0X421C8220U, 0x0U
#define IOMUXC_PIO5_17_HSP_FLEXIO2_FXIO_D28                                                     0x421C01C4U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_18_HSP_GPIO3_GPIO18                                                         0x421C01C8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_MAIN_XSPI1_DATA13                                                        0x421C01C8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_COMM_uSDHC1_DAT1                                                         0x421C01C8U, 0x2U, 0X421C80C4U, 0x0U
#define IOMUXC_PIO5_18_COMM_FlexSPI_FLR_XSPI_FLR_DATA5                                              0x421C01C8U, 0x3U, 0X421C80F4U, 0x0U
#define IOMUXC_PIO5_18_MAIN_AHB_SRAMC_SRAMC_OEB                                                 0x421C01C8U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_18_HSP_SINC0_MBIT2                                                          0x421C01C8U, 0x7U, 0X421C828CU, 0x1U
#define IOMUXC_PIO5_18_HSP_LPSPI4_PCS1                                                          0x421C01C8U, 0x8U, 0X421C8224U, 0x0U
#define IOMUXC_PIO5_18_HSP_FLEXIO2_FXIO_D29                                                     0x421C01C8U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_19_HSP_GPIO3_GPIO19                                                         0x421C01CCU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_19_MAIN_XSPI1_DATA14                                                        0x421C01CCU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_19_COMM_uSDHC1_DAT2                                                         0x421C01CCU, 0x2U, 0X421C80C8U, 0x0U
#define IOMUXC_PIO5_19_COMM_FlexSPI_FLR_XSPI_FLR_DATA6                                              0x421C01CCU, 0x3U, 0X421C80F8U, 0x0U
#define IOMUXC_PIO5_19_MAIN_AHB_SRAMC_SRAMC_ADVB                                                0x421C01CCU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_19_HSP_SINC0_MBIT3                                                          0x421C01CCU, 0x7U, 0X421C8290U, 0x1U
#define IOMUXC_PIO5_19_HSP_LPSPI4_PCS2                                                          0x421C01CCU, 0x8U, 0X421C8228U, 0x0U
#define IOMUXC_PIO5_19_HSP_FLEXIO2_FXIO_D30                                                     0x421C01CCU, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO5_20_HSP_GPIO3_GPIO20                                                         0x421C01D0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_20_MAIN_XSPI1_DATA15                                                        0x421C01D0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_20_COMM_uSDHC1_DAT3                                                         0x421C01D0U, 0x2U, 0X421C80CCU, 0x0U
#define IOMUXC_PIO5_20_COMM_FlexSPI_FLR_XSPI_FLR_DATA7                                              0x421C01D0U, 0x3U, 0X421C80FCU, 0x0U
#define IOMUXC_PIO5_20_MAIN_AHB_SRAMC_SRAMC_WP0                                                 0x421C01D0U, 0x5U, 0X421C83E4U, 0x2U
#define IOMUXC_PIO5_20_HSP_SINC0_BREAK                                                          0x421C01D0U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO5_20_HSP_LPSPI4_PCS3                                                          0x421C01D0U, 0x8U, 0X421C822CU, 0x0U
#define IOMUXC_PIO5_20_HSP_FLEXIO2_FXIO_D31                                                     0x421C01D0U, 0x9U, 0x00000000U, 0x0U

