zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO6_0_HSP_GPIO4_GPIO0                                                           0x421C0200U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_0_MAIN_XSPI0_SCLK0                                                          0x421C0200U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_0_HSP_LPSPI3_SCK                                                            0x421C0200U, 0x8U, 0X421C8214U, 0x1U

#define IOMUXC_PIO6_1_HSP_GPIO4_GPIO1                                                           0x421C0204U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_1_MAIN_XSPI0_SS0_N                                                          0x421C0204U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_1_HSP_LPSPI3_PCS0                                                           0x421C0204U, 0x8U, 0X421C8204U, 0x1U

#define IOMUXC_PIO6_2_HSP_GPIO4_GPIO2                                                           0x421C0208U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_2_MAIN_XSPI0_DATA0                                                          0x421C0208U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_2_HSP_LPSPI3_SOUT                                                           0x421C0208U, 0x8U, 0X421C821CU, 0x1U

#define IOMUXC_PIO6_3_HSP_GPIO4_GPIO3                                                           0x421C020CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_3_MAIN_XSPI0_DATA1                                                          0x421C020CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_3_HSP_LPSPI3_SIN                                                            0x421C020CU, 0x8U, 0X421C8218U, 0x1U

#define IOMUXC_PIO6_4_HSP_GPIO4_GPIO4                                                           0x421C0210U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_4_MAIN_XSPI0_DATA2                                                          0x421C0210U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_4_HSP_LPSPI3_PCS2                                                           0x421C0210U, 0x8U, 0X421C820CU, 0x1U

#define IOMUXC_PIO6_5_HSP_GPIO4_GPIO5                                                           0x421C0214U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_5_MAIN_XSPI0_DATA3                                                          0x421C0214U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_5_HSP_LPSPI3_PCS3                                                           0x421C0214U, 0x8U, 0X421C8210U, 0x1U

#define IOMUXC_PIO6_6_HSP_GPIO4_GPIO6                                                           0x421C0218U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_6_MAIN_XSPI0_DQS0                                                           0x421C0218U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_6_HSP_LPSPI4_PCS3                                                           0x421C0218U, 0x8U, 0X421C822CU, 0x1U

#define IOMUXC_PIO6_7_HSP_GPIO4_GPIO7                                                           0x421C021CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_7_MAIN_XSPI0_DATA4                                                          0x421C021CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_7_COMM_uSDHC0_RESET_B                                                       0x421C021CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_7_HSP_eFlexPWM2_PWM_A0                                                      0x421C021CU, 0x5U, 0X421C8148U, 0x2U
#define IOMUXC_PIO6_7_HSP_LPSPI4_SOUT                                                           0x421C021CU, 0x8U, 0X421C8238U, 0x1U
#define IOMUXC_PIO6_7_HSP_LPUART3_TXD                                                           0x421C021CU, 0x9U, 0X421C8268U, 0x2U

#define IOMUXC_PIO6_8_HSP_GPIO4_GPIO8                                                           0x421C0220U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_8_MAIN_XSPI0_DATA5                                                          0x421C0220U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_8_COMM_uSDHC0_CD_B                                                          0x421C0220U, 0x3U, 0X421C80B0U, 0x1U
#define IOMUXC_PIO6_8_HSP_eFlexPWM2_PWM_B0                                                      0x421C0220U, 0x5U, 0X421C8158U, 0x2U
#define IOMUXC_PIO6_8_HSP_LPSPI4_SIN                                                            0x421C0220U, 0x8U, 0X421C8234U, 0x1U
#define IOMUXC_PIO6_8_HSP_LPUART3_RXD                                                           0x421C0220U, 0x9U, 0X421C8264U, 0x2U

#define IOMUXC_PIO6_9_HSP_GPIO4_GPIO9                                                           0x421C0224U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_9_MAIN_XSPI0_DATA6                                                          0x421C0224U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_9_COMM_uSDHC0_WP                                                            0x421C0224U, 0x3U, 0X421C80B4U, 0x1U
#define IOMUXC_PIO6_9_HSP_eFlexPWM2_PWM_A1                                                      0x421C0224U, 0x5U, 0X421C814CU, 0x2U
#define IOMUXC_PIO6_9_HSP_LPSPI4_PCS2                                                           0x421C0224U, 0x8U, 0X421C8228U, 0x1U
#define IOMUXC_PIO6_9_HSP_LPUART4_TXD                                                           0x421C0224U, 0x9U, 0X421C8274U, 0x3U

#define IOMUXC_PIO6_10_HSP_GPIO4_GPIO10                                                         0x421C0228U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_10_MAIN_XSPI0_DATA7                                                         0x421C0228U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_10_COMM_uSDHC0_VSELECT                                                      0x421C0228U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_10_HSP_eFlexPWM2_PWM_B1                                                     0x421C0228U, 0x5U, 0X421C815CU, 0x2U
#define IOMUXC_PIO6_10_HSP_LPSPI4_PCS3                                                          0x421C0228U, 0x8U, 0X421C822CU, 0x2U
#define IOMUXC_PIO6_10_HSP_LPUART4_RXD                                                          0x421C0228U, 0x9U, 0X421C8270U, 0x3U

#define IOMUXC_PIO6_11_HSP_GPIO4_GPIO11                                                         0x421C022CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_11_MAIN_XSPI0_SS1_N                                                         0x421C022CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_11_HSP_eFlexPWM2_PWM_A2                                                     0x421C022CU, 0x5U, 0X421C8150U, 0x1U
#define IOMUXC_PIO6_11_HSP_LPSPI4_PCS0                                                          0x421C022CU, 0x8U, 0X421C8220U, 0x1U
#define IOMUXC_PIO6_11_HSP_LPUART5_TXD                                                          0x421C022CU, 0x9U, 0X421C8280U, 0x3U

#define IOMUXC_PIO6_12_HSP_GPIO4_GPIO12                                                         0x421C0230U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_12_MAIN_XSPI0_SCLK0_N                                                       0x421C0230U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO6_12_HSP_eFlexPWM2_PWM_B2                                                     0x421C0230U, 0x5U, 0X421C8160U, 0x1U
#define IOMUXC_PIO6_12_HSP_LPSPI4_SCK                                                           0x421C0230U, 0x8U, 0X421C8230U, 0x1U
#define IOMUXC_PIO6_12_HSP_LPUART5_RXD                                                          0x421C0230U, 0x9U, 0X421C827CU, 0x3U

#define IOMUXC_PIO7_0_HSP_GPIO4_GPIO13                                                          0x421C0280U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_0_COMM_uSDHC0_DAT4                                                          0x421C0280U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_0_COMM_FlexSPI_FLR_XSPI_FLR_DATA0                                              0x421C0280U, 0x2U, 0X421C80E0U, 0x1U
#define IOMUXC_PIO7_0_COMM_uSDHC1_DAT0                                                          0x421C0280U, 0x3U, 0X421C80C0U, 0x1U
#define IOMUXC_PIO7_0_HSP_eFlexPWM3_PWM_A0                                                      0x421C0280U, 0x5U, 0X421C8178U, 0x2U
#define IOMUXC_PIO7_0_HSP_LPSPI3_SIN                                                            0x421C0280U, 0x8U, 0X421C8218U, 0x2U

