zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO7_1_HSP_GPIO4_GPIO14                                                          0x421C0284U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_1_COMM_uSDHC0_DAT5                                                          0x421C0284U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_1_COMM_FlexSPI_FLR_XSPI_FLR_DATA1                                              0x421C0284U, 0x2U, 0X421C80E4U, 0x1U
#define IOMUXC_PIO7_1_COMM_uSDHC1_DAT1                                                          0x421C0284U, 0x3U, 0X421C80C4U, 0x1U
#define IOMUXC_PIO7_1_HSP_eFlexPWM3_PWM_B0                                                      0x421C0284U, 0x5U, 0X421C8188U, 0x2U
#define IOMUXC_PIO7_1_HSP_LPSPI3_PCS2                                                           0x421C0284U, 0x8U, 0X421C820CU, 0x2U
#define IOMUXC_PIO7_1_HSP_LPUART3_TXD                                                           0x421C0284U, 0x9U, 0X421C8268U, 0x3U

#define IOMUXC_PIO7_2_HSP_GPIO4_GPIO15                                                          0x421C0288U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_2_COMM_uSDHC0_DAT6                                                          0x421C0288U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_2_COMM_FlexSPI_FLR_XSPI_FLR_DATA2                                              0x421C0288U, 0x2U, 0X421C80E8U, 0x1U
#define IOMUXC_PIO7_2_COMM_uSDHC1_DAT2                                                          0x421C0288U, 0x3U, 0X421C80C8U, 0x1U
#define IOMUXC_PIO7_2_HSP_eFlexPWM3_PWM_A1                                                      0x421C0288U, 0x5U, 0X421C817CU, 0x2U
#define IOMUXC_PIO7_2_HSP_LPSPI3_PCS1                                                           0x421C0288U, 0x8U, 0X421C8208U, 0x1U
#define IOMUXC_PIO7_2_HSP_LPUART3_RXD                                                           0x421C0288U, 0x9U, 0X421C8264U, 0x3U

#define IOMUXC_PIO7_3_HSP_GPIO4_GPIO16                                                          0x421C028CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_3_COMM_uSDHC0_DAT7                                                          0x421C028CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_3_COMM_FlexSPI_FLR_XSPI_FLR_DATA3                                              0x421C028CU, 0x2U, 0X421C80ECU, 0x1U
#define IOMUXC_PIO7_3_COMM_uSDHC1_DAT3                                                          0x421C028CU, 0x3U, 0X421C80CCU, 0x1U
#define IOMUXC_PIO7_3_HSP_eFlexPWM3_PWM_B1                                                      0x421C028CU, 0x5U, 0X421C818CU, 0x2U
#define IOMUXC_PIO7_3_HSP_LPSPI3_PCS0                                                           0x421C028CU, 0x8U, 0X421C8204U, 0x2U
#define IOMUXC_PIO7_3_HSP_LPUART3_CTS_B                                                         0x421C028CU, 0x9U, 0X421C8260U, 0x2U

#define IOMUXC_PIO7_4_HSP_GPIO4_GPIO17                                                          0x421C0290U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_4_COMM_uSDHC0_DS                                                            0x421C0290U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_4_COMM_FlexSPI_FLR_XSPI_FLR_DQS                                              0x421C0290U, 0x2U, 0X421C80DCU, 0x1U
#define IOMUXC_PIO7_4_COMM_uSDHC1_CMD                                                           0x421C0290U, 0x3U, 0X421C80BCU, 0x1U
#define IOMUXC_PIO7_4_HSP_eFlexPWM3_PWM_A2                                                      0x421C0290U, 0x5U, 0X421C8180U, 0x2U
#define IOMUXC_PIO7_4_HSP_LPSPI3_SOUT                                                           0x421C0290U, 0x8U, 0X421C821CU, 0x2U
#define IOMUXC_PIO7_4_HSP_LPUART3_RTS_B                                                         0x421C0290U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO7_5_HSP_GPIO4_GPIO18                                                          0x421C0294U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_5_COMM_FlexSPI_FLR_XSPI_FLR_CLK                                              0x421C0294U, 0x2U, 0X421C8100U, 0x1U
#define IOMUXC_PIO7_5_COMM_uSDHC1_CLK                                                           0x421C0294U, 0x3U, 0X421C80B8U, 0x1U
#define IOMUXC_PIO7_5_HSP_eFlexPWM3_PWM_B2                                                      0x421C0294U, 0x5U, 0X421C8190U, 0x2U
#define IOMUXC_PIO7_5_HSP_LPSPI3_SCK                                                            0x421C0294U, 0x8U, 0X421C8214U, 0x2U

#define IOMUXC_PIO7_6_HSP_GPIO4_GPIO19                                                          0x421C0298U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_6_COMM_uSDHC0_CMD                                                           0x421C0298U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_6_COMM_FlexSPI_FLR_XSPI_FLR_CS                                              0x421C0298U, 0x2U, 0X421C80D8U, 0x1U
#define IOMUXC_PIO7_6_HSP_eFlexPWM0_PWM_A0                                                      0x421C0298U, 0x5U, 0X421C810CU, 0x1U
#define IOMUXC_PIO7_6_HSP_LPSPI4_SOUT                                                           0x421C0298U, 0x8U, 0X421C8238U, 0x2U

#define IOMUXC_PIO7_7_HSP_GPIO4_GPIO20                                                          0x421C029CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_7_COMM_uSDHC0_CLK                                                           0x421C029CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_7_HSP_eFlexPWM0_PWM_B0                                                      0x421C029CU, 0x5U, 0X421C8118U, 0x1U
#define IOMUXC_PIO7_7_HSP_LPSPI4_SCK                                                            0x421C029CU, 0x8U, 0X421C8230U, 0x2U

#define IOMUXC_PIO7_8_HSP_GPIO4_GPIO21                                                          0x421C02A0U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_8_COMM_uSDHC0_DAT0                                                          0x421C02A0U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_8_COMM_FlexSPI_FLR_XSPI_FLR_DATA4                                              0x421C02A0U, 0x2U, 0X421C80F0U, 0x1U
#define IOMUXC_PIO7_8_HSP_eFlexPWM0_PWM_A1                                                      0x421C02A0U, 0x5U, 0X421C8110U, 0x1U
#define IOMUXC_PIO7_8_HSP_LPSPI4_SIN                                                            0x421C02A0U, 0x8U, 0X421C8234U, 0x2U
#define IOMUXC_PIO7_8_HSP_LPUART4_RTS_B                                                         0x421C02A0U, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO7_9_HSP_GPIO4_GPIO22                                                          0x421C02A4U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_9_COMM_uSDHC0_DAT1                                                          0x421C02A4U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_9_COMM_FlexSPI_FLR_XSPI_FLR_DATA5                                              0x421C02A4U, 0x2U, 0X421C80F4U, 0x1U
#define IOMUXC_PIO7_9_HSP_eFlexPWM0_PWM_B1                                                      0x421C02A4U, 0x5U, 0X421C811CU, 0x1U
#define IOMUXC_PIO7_9_HSP_LPSPI4_PCS0                                                           0x421C02A4U, 0x8U, 0X421C8220U, 0x2U
#define IOMUXC_PIO7_9_HSP_LPUART4_CTS_B                                                         0x421C02A4U, 0x9U, 0X421C826CU, 0x3U

#define IOMUXC_PIO7_10_HSP_GPIO4_GPIO23                                                         0x421C02A8U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_10_COMM_uSDHC0_DAT2                                                         0x421C02A8U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_10_COMM_FlexSPI_FLR_XSPI_FLR_DATA6                                              0x421C02A8U, 0x2U, 0X421C80F8U, 0x1U
#define IOMUXC_PIO7_10_HSP_eFlexPWM0_PWM_A2                                                     0x421C02A8U, 0x5U, 0X421C8114U, 0x1U
#define IOMUXC_PIO7_10_HSP_LPSPI4_PCS1                                                          0x421C02A8U, 0x8U, 0X421C8224U, 0x1U
#define IOMUXC_PIO7_10_HSP_LPUART4_TXD                                                          0x421C02A8U, 0x9U, 0x00000000U, 0x0U

