zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_iomuxc_141.h
#define IOMUXC_PIO7_11_HSP_GPIO4_GPIO24                                                         0x421C02ACU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_11_COMM_uSDHC0_DAT3                                                         0x421C02ACU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO7_11_COMM_FlexSPI_FLR_XSPI_FLR_DATA7                                              0x421C02ACU, 0x2U, 0X421C80FCU, 0x1U
#define IOMUXC_PIO7_11_HSP_eFlexPWM0_PWM_B2                                                     0x421C02ACU, 0x5U, 0X421C8120U, 0x1U
#define IOMUXC_PIO7_11_HSP_LPSPI4_PCS2                                                          0x421C02ACU, 0x8U, 0X421C8228U, 0x2U
#define IOMUXC_PIO7_11_HSP_LPUART4_RXD                                                          0x421C02ACU, 0x9U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_0_WAKE_GPIO0_GPIO0                                                          0x46220000U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_CMP3_OUT                                                             0x46220000U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPI2C0_SDA                                                           0x46220000U, 0x2U, 0X4622800CU, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPSPI0_SIN                                                           0x46220000U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_I3C_SDA                                                              0x46220000U, 0x4U, 0X46228004U, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPUART1_CTS_B                                                        0x46220000U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_MICFIL_PDM_DATA01                                                    0x46220000U, 0x6U, 0X46228010U, 0x0U
#define IOMUXC_PIO1_0_WAKE_LPTMR0_ALT0                                                          0x46220000U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_0_WAKE_QTPM0_CH0                                                            0x46220000U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_1_WAKE_GPIO0_GPIO1                                                          0x46220004U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_CMP2_OUT                                                             0x46220004U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPI2C0_SCL                                                           0x46220004U, 0x2U, 0X46228008U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPSPI0_PCS0                                                          0x46220004U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_I3C_SCL                                                              0x46220004U, 0x4U, 0X46228000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPUART1_RTS_B                                                        0x46220004U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_MICFIL_PDM_CLK                                                       0x46220004U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_LPTMR0_ALT1                                                          0x46220004U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_1_WAKE_QTPM0_CH1                                                            0x46220004U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_2_WAKE_GPIO0_GPIO2                                                          0x46220008U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_CMP1_OUT                                                             0x46220008U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_LPSPI0_SCK                                                           0x46220008U, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_I3C_PUR                                                              0x46220008U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_LPUART1_TXD                                                          0x46220008U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_MICFIL_PDM_DATA01                                                    0x46220008U, 0x6U, 0X46228010U, 0x1U
#define IOMUXC_PIO1_2_WAKE_LPTMR0_ALT2                                                          0x46220008U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_2_WAKE_QTPM0_CH2                                                            0x46220008U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_3_WAKE_GPIO0_GPIO3                                                          0x4622000CU, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_CMP0_OUT                                                             0x4622000CU, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_EWM_OUT_B                                                            0x4622000CU, 0x2U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_LPSPI0_SOUT                                                          0x4622000CU, 0x3U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_XBAR_INOUT0                                                          0x4622000CU, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_LPUART1_RXD                                                          0x4622000CU, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_MICFIL_PDM_CLK                                                       0x4622000CU, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_LPTMR0_ALT3                                                          0x4622000CU, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_3_WAKE_QTPM0_CH3                                                            0x4622000CU, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_4_WAKE_GPIO0_GPIO4                                                          0x46220010U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_BOOT_MODE0                                                                0x46220010U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_XBAR_INOUT1                                                          0x46220010U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_LPUART0_TXD                                                          0x46220010U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_FREQME_CLK_OUT                                                       0x46220010U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_LPTMR1_ALT0                                                          0x46220010U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_4_WAKE_QTPM0_CH4                                                            0x46220010U, 0x8U, 0x00000000U, 0x0U

#define IOMUXC_PIO1_5_WAKE_GPIO0_GPIO5                                                          0x46220014U, 0x0U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_BOOT_MODE1                                                                0x46220014U, 0x1U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_XBAR_INOUT2                                                          0x46220014U, 0x4U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_LPUART0_RXD                                                          0x46220014U, 0x5U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_VBAT_RTC_CLKOUT                                                           0x46220014U, 0x6U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_LPTMR1_ALT1                                                          0x46220014U, 0x7U, 0x00000000U, 0x0U
#define IOMUXC_PIO1_5_WAKE_QTPM0_CH5                                                            0x46220014U, 0x8U, 0x00000000U, 0x0U

